-------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  C:\Users\Templeton\Desktop\GAPP\GAPP-UGANDA-HARUNA\ww-ug\10_MZ/rep/090_temp_in
> dex.log
  log type:  text
 opened on:  17 May 2013, 16:44:13

. clear

. set more off

. #delimit ;
delimiter now ;
. **************************************************************************
> * 090_temp_index.do     (start)
> **************************************************************************;
. *do "$path/new/010_initial.do";
. **************************************************************************
> * Program to compute the temporal price index (intra-survey)
> * 
> * The index is based on 6 regions (North/Center/South by rural/urban) 
> * and four quarters. For IAF 2002/03 (t=t1) it is based on the same 9
> * commodities used for the analysis of the 1996 IAF (t=t0), 
> * except that we have to go to 8 commodities because the 2002-03 survey 
> * does not distinguish between large and small groundnuts, which were 
> * separate items in the old index. For IOF 2008/09 (t=t2) we expand the
> * the food basket to include the 15 most important food products among
> * the poorest.
> *
> * The commodity weights for the items vary by the 6 regions, and are 
> * calculated from the observations in the IAF2002, using the relatively 
> * poor households (below median nominal consumption per capita).
> *
> * The unit values (prices) calculated here are also based on the prices 
> * paid by the relatively poor, using the same definition.
> *
> * K Simler, Sep 2003
> * CA
> * MAH, April 2010
> **************************************************************************;
. /*
> This file uses:
>         work\own.dta
>         work\receipts.dta
>         work\daily.dta
>         work\hhdata
>         work\cons_cat.dta
> 
> This file creates:
>         work\tpi_unit_val_quarterly.dta
>         work\tpi_unit_val_monthly.dta
>         work\tpi_news_share.dta
>         work\tpi_reg_tpi_share.dta
>         work\temp_index_news.dta
>         work\temp_index_reg_tpi.dta
> */      
> 
> 
> **************************************************************************
> * Either the products used for intertemporal price index is specified
> * explicitly, or they are automatically found as the the n_tpi products
> * with the highest weighted expenditure shares among the $bottom % poorest
> * part of the population
> **************************************************************************;
. * Generating the n_tpi most important food items for the poorest $bottom % ;
. **************************************************************************
> * Find the n_tpi most important food products among the lowest $bottom %
> * (start)
> **************************************************************************;
. *------------------------------------------------------------------------*
> * Population weights for each HH
> *------------------------------------------------------------------------*;
. use "$path/work\hhdata.dta", clear;

. keep hhid hhweight hhsize;

. gen popwt = hhweight*hhsize;

. lab var popwt "Population weights = hhsize X hhweight";

. sort hhid;

. tempfile popwt;

. save `popwt', replace;
(note: file C:\Users\TEMPLE~1\AppData\Local\Temp\ST_0j000001.tmp not found)
file C:\Users\TEMPLE~1\AppData\Local\Temp\ST_0j000001.tmp saved

. sum;

    Variable |       Obs        Mean    Std. Dev.       Min        Max
-------------+--------------------------------------------------------
    hhweight |     10832    425.7335    395.1881   39.58433   8495.651
        hhid |     10832    543185.7    312349.5       1005    1060074
      hhsize |     10832    4.724612    2.511602          1         34
       popwt |     10832    1988.293    2359.555   54.63167   93452.16

. *------------------------------------------------------------------------*
> * Make list of all consumed products
> *------------------------------------------------------------------------*;
. *use "$path/in\cons_cod.dta", clear;
. *save "$path/work\cons_cod.dta", replace;
. use "$path/work\cons_cod.dta", clear;

. keep product descript;

. collapse product, by(descript);

. sort product;

. tempfile descript;

. save `descript', replace;
(note: file C:\Users\TEMPLE~1\AppData\Local\Temp\ST_0j000002.tmp not found)
file C:\Users\TEMPLE~1\AppData\Local\Temp\ST_0j000002.tmp saved

. sum;

    Variable |       Obs        Mean    Std. Dev.       Min        Max
-------------+--------------------------------------------------------
    descript |         0
     product |       886    86651.12    165295.4      11112    1270051

. *------------------------------------------------------------------------*
> * Find the poorest part of the population
> *------------------------------------------------------------------------*;
. use
> "$path/work\cons_cod.dta", clear;

. *use
> *"$path/work\cons_cod.dta", clear;
. keep hhid prod_cat product cod_hh_nom;

. sort hhid;

. sum;

    Variable |       Obs        Mean    Std. Dev.       Min        Max
-------------+--------------------------------------------------------
        hhid |    257521    569044.3    332482.7       1005    1060074
     product |    257519    42979.03    65919.85      11112    1270051
    prod_cat |    257521     3.71426    3.463399          1         12
  cod_hh_nom |    257521    5.830475    23.51364          0   3947.368

. merge hhid using `popwt';
variable hhid does not uniquely identify observations in the master data

. sum;

    Variable |       Obs        Mean    Std. Dev.       Min        Max
-------------+--------------------------------------------------------
        hhid |    257521    569044.3    332482.7       1005    1060074
     product |    257519    42979.03    65919.85      11112    1270051
    prod_cat |    257521     3.71426    3.463399          1         12
  cod_hh_nom |    257521    5.830475    23.51364          0   3947.368
    hhweight |    257521    390.7616    359.8982   39.58433   8495.651
-------------+--------------------------------------------------------
      hhsize |    257521    4.967374    2.564528          1         34
       popwt |    257521    1912.152    2194.674   54.63167   93452.16
      _merge |    257521           3           0          3          3

. drop _merge;

. preserve;

. collapse (sum) cod_hh_nom (mean) popwt hhweight hhsize, by(hhid);

. gen cod_pc_nom = cod_hh_nom/hhsize;

.         sum cod_pc_nom [aw=popwt] , detail;

                         cod_pc_nom
-------------------------------------------------------------
      Percentiles      Smallest
 1%     2.217581       .5010331
 5%     5.141517       .6294842
10%     6.588092       .7758194       Obs               10832
25%     10.19053       .8589561       Sum of Wgt.  21537187.8

50%     16.42623                      Mean           24.03431
                        Largest       Std. Dev.      38.76576
75%     26.60812       1583.719
90%     42.24796       1584.194       Variance       1502.784
95%     59.00286       1653.955       Skewness       20.50937
99%      149.504       4744.847       Kurtosis       1356.488

.         global medcpc_= r(p$tpi_bottom);

.         gen bottom_ = cod_pc_nom <= $medcpc_;

. sum [aw=popwt];

    Variable |     Obs      Weight        Mean   Std. Dev.       Min        Max
-------------+-----------------------------------------------------------------
        hhid |   10832  21537187.8      489991   282388.2       1005    1060074
  cod_hh_nom |   10832  21537187.8    129.7583   180.4462   1.079779   5191.784
       popwt |   10832  21537187.8    4788.176   8284.167   54.63167   93452.16
    hhweight |   10832  21537187.8    797.6361   1136.918   39.58433   8495.651
      hhsize |   10832  21537187.8    5.956326   2.804515          1         34
-------------+-----------------------------------------------------------------
  cod_pc_nom |   10832  21537187.8    24.03431   38.76576   .5010331   4744.847
     bottom_ |   10832  21537187.8    .4998883   .5000231          0          1

. sum [aw=hhweight];

    Variable |     Obs      Weight        Mean   Std. Dev.       Min        Max
-------------+-----------------------------------------------------------------
        hhid |   10832  4611544.75      480914   283193.3       1005    1060074
  cod_hh_nom |   10832  4611544.75    112.2469   168.1939   1.079779   5191.784
       popwt |   10832  4611544.75    3725.181   6519.597   54.63167   93452.16
    hhweight |   10832  4611544.75     792.534   1120.219   39.58433   8495.651
      hhsize |   10832  4611544.75    4.670276    2.45087          1         34
-------------+-----------------------------------------------------------------
  cod_pc_nom |   10832  4611544.75    28.23469   51.30026   .5010331   4744.847
     bottom_ |   10832  4611544.75    .4382052   .4961896          0          1

. sum;

    Variable |       Obs        Mean    Std. Dev.       Min        Max
-------------+--------------------------------------------------------
        hhid |     10832    543185.7    312349.5       1005    1060074
  cod_hh_nom |     10832    138.6143    226.7812   1.079779   5191.784
       popwt |     10832    1988.293    2359.555   54.63167   93452.16
    hhweight |     10832    425.7335    395.1881   39.58433   8495.651
      hhsize |     10832    4.724612    2.511602          1         34
-------------+--------------------------------------------------------
  cod_pc_nom |     10832    35.29387    79.26459   .5010331   4744.847
     bottom_ |     10832    .3779542    .4848985          0          1

. keep if bottom_==1;
(6738 observations deleted)

. keep hhid;

. sort hhid;

. tempfile hhid;

. save `hhid';
file C:\Users\TEMPLE~1\AppData\Local\Temp\ST_0j000004.tmp saved

. restore;

. sort hhid;

. sum;

    Variable |       Obs        Mean    Std. Dev.       Min        Max
-------------+--------------------------------------------------------
        hhid |    257521    569044.3    332482.7       1005    1060074
     product |    257519    42979.03    65919.85      11112    1270051
    prod_cat |    257521     3.71426    3.463399          1         12
  cod_hh_nom |    257521    5.830475    23.51364          0   3947.368
    hhweight |    257521    390.7616    359.8982   39.58433   8495.651
-------------+--------------------------------------------------------
      hhsize |    257521    4.967374    2.564528          1         34
       popwt |    257521    1912.152    2194.674   54.63167   93452.16

. merge hhid using `hhid';
variable hhid does not uniquely identify observations in the master data

. tab _m;

     _merge |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |    183,128       71.11       71.11
          3 |     74,393       28.89      100.00
------------+-----------------------------------
      Total |    257,521      100.00

. keep if _m==3;
(183128 observations deleted)

. sum;

    Variable |       Obs        Mean    Std. Dev.       Min        Max
-------------+--------------------------------------------------------
        hhid |     74393    471707.4    268262.5       1055    1060028
     product |     74392    38906.52    62011.39      11112    1213291
    prod_cat |     74393    3.343419    3.139026          1         12
  cod_hh_nom |     74393    3.072649    5.599496          0   115.1316
    hhweight |     74393    481.6085    472.3776   39.58433   8495.651
-------------+--------------------------------------------------------
      hhsize |     74393    5.739438    2.406917          1         23
       popwt |     74393    2695.381    3039.917   79.16866   93452.16
      _merge |     74393           3           0          3          3

. *------------------------------------------------------------------------*
> * Keep only food product expenditure by the poor. Calculate food product
> * share of total food expenditure by the poor
> *------------------------------------------------------------------------*;
. keep if prod_cat==1;
(35649 observations deleted)

. sum;

    Variable |       Obs        Mean    Std. Dev.       Min        Max
-------------+--------------------------------------------------------
        hhid |     38744    466312.1      267634       1055    1060028
     product |     38744    13207.95    13073.43      11112     119291
    prod_cat |     38744           1           0          1          1
  cod_hh_nom |     38744    3.846664    6.664107          0      112.3
    hhweight |     38744    485.2986    484.7341   39.58433   8495.651
-------------+--------------------------------------------------------
      hhsize |     38744    5.701167    2.396925          1         23
       popwt |     38744    2697.341    3074.131   79.16866   93452.16
      _merge |     38744           3           0          3          3

. sort product;

. *preserve;
. collapse (sum) cod_hh_nom [aw=hhweight], by(product);

. sort cod;

. egen total=sum(cod_hh_nom);

. gen sh=100*cod_hh_nom/total;

. *------------------------------------------------------------------------*
> * Include product labels
> *------------------------------------------------------------------------*;
. sum;

    Variable |       Obs        Mean    Std. Dev.       Min        Max
-------------+--------------------------------------------------------
     product |       228    21521.09    30554.25      11112     119291
  cod_hh_nom |       228    639.7683    2469.228          0   29402.53
       total |       228    145867.2           0   145867.2   145867.2
          sh |       228    .4385965    1.692792          0   20.15705

. sort product;

. merge product using `descript';
product was long now double
variable product does not uniquely identify observations in
    C:\Users\TEMPLE~1\AppData\Local\Temp\ST_0j000002.tmp

. tab _merge;

     _merge |      Freq.     Percent        Cum.
------------+-----------------------------------
          2 |        659       74.30       74.30
          3 |        228       25.70      100.00
------------+-----------------------------------
      Total |        887      100.00

. keep if _merge==1 | _merge==3;
(659 observations deleted)

. drop _merge;

. sort sh;

. *list;
. list in -$product_tpi_n/-1;

     +-------------------------------------------------------------------------+
214. |    product     |     cod_hh~m     |        total     |           sh     |
     |      11751     |     2466.509     |     145867.2     |     1.690928     |
     |-------------------------------------------------------------------------|
     |                                                                descript |
     |                                                         Feijão manteiga |
     +-------------------------------------------------------------------------+

     +-------------------------------------------------------------------------+
215. |    product     |     cod_hh~m     |        total     |           sh     |
     |      11731     |     2733.824     |     145867.2     |     1.874187     |
     |-------------------------------------------------------------------------|
     |                                                                descript |
     |                                                                  Tomate |
     +-------------------------------------------------------------------------+

     +-------------------------------------------------------------------------+
216. |    product     |     cod_hh~m     |        total     |           sh     |
     |      11712     |     2782.264     |     145867.2     |     1.907396     |
     |-------------------------------------------------------------------------|
     |                                                                descript |
     |                                                    Folhas de aboboreira |
     +-------------------------------------------------------------------------+

     +-------------------------------------------------------------------------+
217. |    product     |     cod_hh~m     |        total     |           sh     |
     |      11541     |      2858.13     |     145867.2     |     1.959406     |
     |-------------------------------------------------------------------------|
     |                                                                descript |
     |                                                        Óleo de girassol |
     +-------------------------------------------------------------------------+

     +-------------------------------------------------------------------------+
218. |    product     |     cod_hh~m     |        total     |           sh     |
     |      11676     |     3516.353     |     145867.2     |     2.410654     |
     |-------------------------------------------------------------------------|
     |                                                                descript |
     |                                                 Coco( inteiro e ralado) |
     +-------------------------------------------------------------------------+

     +-------------------------------------------------------------------------+
219. |    product     |     cod_hh~m     |        total     |           sh     |
     |      11782     |     3674.032     |     145867.2     |     2.518751     |
     |-------------------------------------------------------------------------|
     |                                                                descript |
     |                                                         Mandioca fresca |
     +-------------------------------------------------------------------------+

     +-------------------------------------------------------------------------+
220. |    product     |     cod_hh~m     |        total     |           sh     |
     |      11279     |     4033.753     |     145867.2     |      2.76536     |
     |-------------------------------------------------------------------------|
     |                                                                descript |
     | Aves vivas e outros animais vivos comprados para consumo como alimentos |
     +-------------------------------------------------------------------------+

     +-------------------------------------------------------------------------+
221. |    product     |     cod_hh~m     |        total     |           sh     |
     |      11752     |     4222.164     |     145867.2     |     2.894526     |
     |-------------------------------------------------------------------------|
     |                                                                descript |
     |                                              Feijão nhemba em grão seco |
     +-------------------------------------------------------------------------+

     +-------------------------------------------------------------------------+
222. |    product     |     cod_hh~m     |        total     |           sh     |
     |      11311     |     4574.407     |     145867.2     |     3.136008     |
     |-------------------------------------------------------------------------|
     |                                                                descript |
     |                               "Serra  fresca, refrigerada ou congelada" |
     +-------------------------------------------------------------------------+

     +-------------------------------------------------------------------------+
223. |    product     |     cod_hh~m     |        total     |           sh     |
     |      11674     |     5065.883     |     145867.2     |     3.472942     |
     |-------------------------------------------------------------------------|
     |                                                                descript |
     |                                               Amendoim  (casca e miolo) |
     +-------------------------------------------------------------------------+

     +-------------------------------------------------------------------------+
224. |    product     |     cod_hh~m     |        total     |           sh     |
     |      11361     |     6695.263     |     145867.2     |     4.589972     |
     |-------------------------------------------------------------------------|
     |                                                                descript |
     |                                           Peixe seco (excepto bacalhau) |
     +-------------------------------------------------------------------------+

     +-------------------------------------------------------------------------+
225. |    product     |     cod_hh~m     |        total     |           sh     |
     |      11121     |     7188.521     |     145867.2     |     4.928128     |
     |-------------------------------------------------------------------------|
     |                                                                descript |
     |                                                    Milho em grão branco |
     +-------------------------------------------------------------------------+

     +-------------------------------------------------------------------------+
226. |    product     |     cod_hh~m     |        total     |           sh     |
     |      11112     |     9784.768     |     145867.2     |     6.707998     |
     |-------------------------------------------------------------------------|
     |                                                                descript |
     |                                                     Arroz grão corrente |
     +-------------------------------------------------------------------------+

     +-------------------------------------------------------------------------+
227. |    product     |     cod_hh~m     |        total     |           sh     |
     |      11146     |     15243.74     |     145867.2     |     10.45043     |
     |-------------------------------------------------------------------------|
     |                                                                descript |
     |                                                     Farinha de mandioca |
     +-------------------------------------------------------------------------+

     +-------------------------------------------------------------------------+
228. |    product     |     cod_hh~m     |        total     |           sh     |
     |      11141     |     29402.53     |     145867.2     |     20.15705     |
     |-------------------------------------------------------------------------|
     |                                                                descript |
     |                                                        Farinha de milho |
     +-------------------------------------------------------------------------+

. list product descript in -$product_tpi_n/-1;

     +-----------------------------------------------------------------------------------+
     | product                                                                  descript |
     |-----------------------------------------------------------------------------------|
214. |   11751                                                           Feijão manteiga |
215. |   11731                                                                    Tomate |
216. |   11712                                                      Folhas de aboboreira |
217. |   11541                                                          Óleo de girassol |
218. |   11676                                                   Coco( inteiro e ralado) |
     |-----------------------------------------------------------------------------------|
219. |   11782                                                           Mandioca fresca |
220. |   11279   Aves vivas e outros animais vivos comprados para consumo como alimentos |
221. |   11752                                                Feijão nhemba em grão seco |
222. |   11311                                 "Serra  fresca, refrigerada ou congelada" |
223. |   11674                                                 Amendoim  (casca e miolo) |
     |-----------------------------------------------------------------------------------|
224. |   11361                                             Peixe seco (excepto bacalhau) |
225. |   11121                                                      Milho em grão branco |
226. |   11112                                                       Arroz grão corrente |
227. |   11146                                                       Farinha de mandioca |
228. |   11141                                                          Farinha de milho |
     +-----------------------------------------------------------------------------------+

. *restore;
. *------------------------------------------------------------------------*
> * Keep the required number of most important food products
> *------------------------------------------------------------------------*;
. keep in -$product_tpi_n/-1;
(213 observations deleted)

. list;

     +-------------------------------------------------------------------------+
  1. |    product     |     cod_hh~m     |        total     |           sh     |
     |      11751     |     2466.509     |     145867.2     |     1.690928     |
     |-------------------------------------------------------------------------|
     |                                                                descript |
     |                                                         Feijão manteiga |
     +-------------------------------------------------------------------------+

     +-------------------------------------------------------------------------+
  2. |    product     |     cod_hh~m     |        total     |           sh     |
     |      11731     |     2733.824     |     145867.2     |     1.874187     |
     |-------------------------------------------------------------------------|
     |                                                                descript |
     |                                                                  Tomate |
     +-------------------------------------------------------------------------+

     +-------------------------------------------------------------------------+
  3. |    product     |     cod_hh~m     |        total     |           sh     |
     |      11712     |     2782.264     |     145867.2     |     1.907396     |
     |-------------------------------------------------------------------------|
     |                                                                descript |
     |                                                    Folhas de aboboreira |
     +-------------------------------------------------------------------------+

     +-------------------------------------------------------------------------+
  4. |    product     |     cod_hh~m     |        total     |           sh     |
     |      11541     |      2858.13     |     145867.2     |     1.959406     |
     |-------------------------------------------------------------------------|
     |                                                                descript |
     |                                                        Óleo de girassol |
     +-------------------------------------------------------------------------+

     +-------------------------------------------------------------------------+
  5. |    product     |     cod_hh~m     |        total     |           sh     |
     |      11676     |     3516.353     |     145867.2     |     2.410654     |
     |-------------------------------------------------------------------------|
     |                                                                descript |
     |                                                 Coco( inteiro e ralado) |
     +-------------------------------------------------------------------------+

     +-------------------------------------------------------------------------+
  6. |    product     |     cod_hh~m     |        total     |           sh     |
     |      11782     |     3674.032     |     145867.2     |     2.518751     |
     |-------------------------------------------------------------------------|
     |                                                                descript |
     |                                                         Mandioca fresca |
     +-------------------------------------------------------------------------+

     +-------------------------------------------------------------------------+
  7. |    product     |     cod_hh~m     |        total     |           sh     |
     |      11279     |     4033.753     |     145867.2     |      2.76536     |
     |-------------------------------------------------------------------------|
     |                                                                descript |
     | Aves vivas e outros animais vivos comprados para consumo como alimentos |
     +-------------------------------------------------------------------------+

     +-------------------------------------------------------------------------+
  8. |    product     |     cod_hh~m     |        total     |           sh     |
     |      11752     |     4222.164     |     145867.2     |     2.894526     |
     |-------------------------------------------------------------------------|
     |                                                                descript |
     |                                              Feijão nhemba em grão seco |
     +-------------------------------------------------------------------------+

     +-------------------------------------------------------------------------+
  9. |    product     |     cod_hh~m     |        total     |           sh     |
     |      11311     |     4574.407     |     145867.2     |     3.136008     |
     |-------------------------------------------------------------------------|
     |                                                                descript |
     |                               "Serra  fresca, refrigerada ou congelada" |
     +-------------------------------------------------------------------------+

     +-------------------------------------------------------------------------+
 10. |    product     |     cod_hh~m     |        total     |           sh     |
     |      11674     |     5065.883     |     145867.2     |     3.472942     |
     |-------------------------------------------------------------------------|
     |                                                                descript |
     |                                               Amendoim  (casca e miolo) |
     +-------------------------------------------------------------------------+

     +-------------------------------------------------------------------------+
 11. |    product     |     cod_hh~m     |        total     |           sh     |
     |      11361     |     6695.263     |     145867.2     |     4.589972     |
     |-------------------------------------------------------------------------|
     |                                                                descript |
     |                                           Peixe seco (excepto bacalhau) |
     +-------------------------------------------------------------------------+

     +-------------------------------------------------------------------------+
 12. |    product     |     cod_hh~m     |        total     |           sh     |
     |      11121     |     7188.521     |     145867.2     |     4.928128     |
     |-------------------------------------------------------------------------|
     |                                                                descript |
     |                                                    Milho em grão branco |
     +-------------------------------------------------------------------------+

     +-------------------------------------------------------------------------+
 13. |    product     |     cod_hh~m     |        total     |           sh     |
     |      11112     |     9784.768     |     145867.2     |     6.707998     |
     |-------------------------------------------------------------------------|
     |                                                                descript |
     |                                                     Arroz grão corrente |
     +-------------------------------------------------------------------------+

     +-------------------------------------------------------------------------+
 14. |    product     |     cod_hh~m     |        total     |           sh     |
     |      11146     |     15243.74     |     145867.2     |     10.45043     |
     |-------------------------------------------------------------------------|
     |                                                                descript |
     |                                                     Farinha de mandioca |
     +-------------------------------------------------------------------------+

     +-------------------------------------------------------------------------+
 15. |    product     |     cod_hh~m     |        total     |           sh     |
     |      11141     |     29402.53     |     145867.2     |     20.15705     |
     |-------------------------------------------------------------------------|
     |                                                                descript |
     |                                                        Farinha de milho |
     +-------------------------------------------------------------------------+

. gen product_tpi=1;

. keep product product_tpi;

. list;

     +--------------------+
     | product   produc~i |
     |--------------------|
  1. |   11751          1 |
  2. |   11731          1 |
  3. |   11712          1 |
  4. |   11541          1 |
  5. |   11676          1 |
     |--------------------|
  6. |   11782          1 |
  7. |   11279          1 |
  8. |   11752          1 |
  9. |   11311          1 |
 10. |   11674          1 |
     |--------------------|
 11. |   11361          1 |
 12. |   11121          1 |
 13. |   11112          1 |
 14. |   11146          1 |
 15. |   11141          1 |
     +--------------------+

. sort product;

. tempfile product_tpi;

. save `product_tpi', replace;
(note: file C:\Users\TEMPLE~1\AppData\Local\Temp\ST_0j000005.tmp not found)
file C:\Users\TEMPLE~1\AppData\Local\Temp\ST_0j000005.tmp saved

. sum;

    Variable |       Obs        Mean    Std. Dev.       Min        Max
-------------+--------------------------------------------------------
     product |        15    11472.67    268.3715      11112      11782
 product_tpi |        15           1           0          1          1

. clear;

. **************************************************************************
> * Find the n_tpi most important food products among the lowest $bottom %
> * (end)
> **************************************************************************;
. **************************************************************************;
. * First, need to calculate the average prices for the food items, by 
> * strata and quarter. For this, we are using the "unit values"
> * (value/quantity) for the observations in the consumption questionnaires,
> * including daily, own and receipts-in-kind.
> *
> * The unit values are constructed as sum(value)/sum(quantity), which effectively
> * weights them by the quantity and value of the transaction. Sampling
> * weights are also used.
> *
> * Get the own consumption file, and limit analysis to the observations
> * in KGs where both value and quantity are available. For IOF 2009 non-KG
> * observations are converted into KG just like in a lot other places
> * imn the code.
> **************************************************************************;
. use "$path/work/cons_cod.dta";

. *use "$path/work/cons_cod.dta";
. keep if prod_cat==1;
(132804 observations deleted)

. drop if quantityd==0 | quantityd==.;
(10364 observations deleted)

. *keep if quantityd!=. & cod_hh_nom2!=.;
. sum;

    Variable |       Obs        Mean    Std. Dev.       Min        Max
-------------+--------------------------------------------------------
        hhid |    114353      563547    326669.1       1005    1060074
     product |    114353    12643.16    10541.64      11112     119291
    descript |         0
    food_cat |    114353           1           0          1          1
    prod_cat |    114353           1           0          1          1
-------------+--------------------------------------------------------
       value |     75394    34.52179    65.60229          0       2005
   quantityd |    114353    .3124826    .6452984   .0000476      23.31
  cod_hh_nom |    114353    5.478934    11.56122          0   828.3114
 cod_hh_nom2 |    114353    5.376005     11.3972          0   813.9857
 cod_hh_nom3 |    114353      5.3629    11.41183          0   813.9857

. sort product;

. merge product using `product_tpi';
variable product does not uniquely identify observations in the master data
product was long now double

. tab _merge;

     _merge |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |     59,412       51.95       51.95
          3 |     54,941       48.05      100.00
------------+-----------------------------------
      Total |    114,353      100.00

. drop _merge;

. keep if $product_tpi;
(59412 observations deleted)

. *        replace valued_ac=0 if valued_ac==.;
. *        replace quantityd_ac=0 if quantityd_ac==.;
.         gen valued_tot=cod_hh_nom2;

.         gen quantityd_tot=quantityd;

. *               replace quantityd_tot=0 if (valued_tot>0 & valued_tot<.) & quantityd_tot=
> =.;
.         keep if quantityd_tot!=. & valued_tot!=.;
(0 observations deleted)

.                 collapse (sum) valued_tot quantityd_tot, by(hhid product);

.                 sort hhid;

. tempfile acredd;

. save `acredd' , replace;
(note: file C:\Users\TEMPLE~1\AppData\Local\Temp\ST_0j000006.tmp not found)
file C:\Users\TEMPLE~1\AppData\Local\Temp\ST_0j000006.tmp saved

. sum;

    Variable |       Obs        Mean    Std. Dev.       Min        Max
-------------+--------------------------------------------------------
        hhid |     54941      513866    315664.1       1005    1060074
     product |     54941    11503.54      247.74      11112      11782
  valued_tot |     54941    7.173119    14.17906          0   813.9857
quantityd_~t |     54941    .3895977    .7253671   .0002595   20.57143

. /*
> **************************************************************************;
> * Create a data set with an empty 1 observation. Used to avoid empty data
> * sets when the survey do not have the Mozambican set up
> **************************************************************************;
> use "$path/work/own.dta";
> 
> preserve;
> keep in 1;
> drop unit valued quantityd;
> gen unit=2;
> gen valued=0;
> gen quantityd=0;
> tempfile 1obs;
> save `1obs';
> restore;
> 
> **************************************************************************;
> * Own consumption
> **************************************************************************;
> sum;
> sort product;
> merge product using `product_tpi';
> tab _merge;
> drop _merge;
> 
> keep if $product_tpi;
> 
> 
> 
> * Comment out below if IAF 2002/03 ( START ) ;
> 
> rename quantityd quantity;
> do "$path/new/110a_conversions.do";
> rename quantity quantityd;
> 
> * Comment out below if IAF 2002/03 ( END ) ;
> 
> 
> 
>         keep if unit==2 & quantityd!=. & valued!=.;
>         collapse (sum) valued quantityd , by(hhid product);
>         rename valued valued_ac;
>         rename quantityd quantityd_ac;
>         compress;
>         sort hhid product;
>         tempfile ac;
> save `ac', replace;
> 
> **************************************************************************;
> * Now do a similar thing with receipts-in-kind file.
> **************************************************************************;
> use "$path/work/receipts.dta";
> 
> sum;
> sort product;
> merge product using `product_tpi';
> tab _merge;
> drop _merge;
> 
> 
> 
> keep if $product_tpi;
> append using `1obs';
> 
> 
> 
> * Comment out below if IAF 2002/03 ( START ) ;
> 
> rename quantityd quantity;
> do "$path/new/110a_conversions.do";
> rename quantity quantityd;
> 
> * Comment out below if IAF 2002/03 ( END ) ;
> 
> 
> 
>         keep if unit==2 & quantityd!=. & valued!=.;
>         collapse (sum) valued quantityd , by(hhid product);
>         rename valued valued_re;
>         rename quantityd quantityd_re;
>         compress;
>         sort hhid product;
>         tempfile re;
> save `re', replace;
> 
> **************************************************************************;
> * And also with the daily expenditure file.
> **************************************************************************;
> use "$path/work/daily.dta";
> 
> sum;
> sort product;
> merge product using `product_tpi';
> tab _merge;
> drop _merge;
> 
> keep if $product_tpi;
> 
> 
> 
> * Comment out below if IAF 2002/03 ( START ) ;
> 
> *rename quantityd quantity;
> do "$path/new/110a_conversions.do";
> *rename quantity quantityd;
> 
> * Comment out below if IAF 2002/03 ( END ) ;
> 
> 
> 
>         collapse (sum) value quantity days , 
>                 by(hhid product unit);
> 
>         gen valued=value/7 if days<=7;
>         replace valued=value/days if days>7 & days<.;
>         gen quantityd=quantity/7 if days<=7;
>         replace quantityd=quantity/days if days>7 & days<.;
> 
>         keep if unit==2 & quantityd!=. & valued!=.;
>         collapse (sum) valued quantityd , by(hhid product);
> 
>         rename valued valued_dd;
>         rename quantityd quantityd_dd;
>         compress;
>         sort hhid product;
>         tempfile dd;
> save `dd', replace;
> 
> 
> 
> 
> **************************************************************************;
> * Merge the three components (own, daily, receipts) together at the HH/product level, 
> * then aggregate to the regional level, using the sample weights (hhweight).
> * We DON'T want to weight by "hhsize" because the quantity and value are
> * already for the household (i.e., other things equal, larger households
> * are buying larger quantities, and therefore already getting more weight).
> * Then calculate sum(val)/sum(quantity) to get the quantity weighted mean
> * unit value in each strata in each quarter.
> **************************************************************************;
> use `ac';
>         sort hhid product;
>         merge hhid product using `re';
>         tab _m;
>         drop _m;
>         
>         sort hhid product;
>         merge hhid product using `dd';
>         tab _m;
>         drop _m;
>         
>         replace valued_ac=0 if valued_ac==.;
>         replace valued_re=0 if valued_re==.;
>         replace valued_dd=0 if valued_dd==.;
>         replace quantityd_ac=0 if quantityd_ac==.;
>         replace quantityd_re=0 if quantityd_re==.;
>         replace quantityd_dd=0 if quantityd_dd==.;
> 
>         gen valued_tot=valued_ac+valued_re+valued_dd;
>         gen quantityd_tot=quantityd_ac+quantityd_re+quantityd_dd;
> 
>         sort hhid;
> 
>         tempfile acredd;
> save `acredd' , replace;
> */
> 
> 
> 
> use "$path/work/hhdata.dta";

.         keep strata hhid hhweight hhsize rural survmon survquar news spdomain reg_tpi;

.         sort hhid;

.         tempfile hhd;

. save `hhd' , replace;
(note: file C:\Users\TEMPLE~1\AppData\Local\Temp\ST_0j000007.tmp not found)
file C:\Users\TEMPLE~1\AppData\Local\Temp\ST_0j000007.tmp saved

. use `acredd', clear;

.         merge hhid using `hhd';
variable hhid does not uniquely identify observations in the master data

.         tab _merge;

     _merge |      Freq.     Percent        Cum.
------------+-----------------------------------
          2 |        228        0.41        0.41
          3 |     54,941       99.59      100.00
------------+-----------------------------------
      Total |     55,169      100.00

.         drop _merge;

.                 tab survquar , miss;

Time period |      Freq.     Percent        Cum.
------------+-----------------------------------
 Sep-Nov 08 |     13,471       24.42       24.42
 Dec-Feb 09 |     12,367       22.42       46.83
 Mar-May 09 |     15,321       27.77       74.61
 Jun-Aug 09 |     14,010       25.39      100.00
------------+-----------------------------------
      Total |     55,169      100.00

.                 tab survmon survquar, miss;

Sequential |
    survey |
     month |
(September |                 Time period
   2008=1) | Sep-Nov 0  Dec-Feb 0  Mar-May 0  Jun-Aug 0 |     Total
-----------+--------------------------------------------+----------
    Sep 08 |     4,504          0          0          0 |     4,504 
    Oct 08 |     5,220          0          0          0 |     5,220 
    Nov 08 |     3,747          0          0          0 |     3,747 
    Dec 08 |         0      4,364          0          0 |     4,364 
    Jan 09 |         0      4,650          0          0 |     4,650 
    Feb 09 |         0      3,353          0          0 |     3,353 
    Mar 09 |         0          0      4,909          0 |     4,909 
    Apr 09 |         0          0      4,925          0 |     4,925 
    May 09 |         0          0      5,487          0 |     5,487 
    Jun 09 |         0          0          0      5,220 |     5,220 
    Jul 09 |         0          0          0      5,024 |     5,024 
    Aug 09 |         0          0          0      3,766 |     3,766 
-----------+--------------------------------------------+----------
     Total |    13,471     12,367     15,321     14,010 |    55,169 


.         compress;
survmon was float now byte
survquar was float now byte
rural was float now byte
news was float now byte
reg_tpi was float now byte
strata was float now byte
spdomain was float now byte
product was double now int

.         sort hhid;

. save `acredd', replace;
file C:\Users\TEMPLE~1\AppData\Local\Temp\ST_0j000006.tmp saved

. sum;

    Variable |       Obs        Mean    Std. Dev.       Min        Max
-------------+--------------------------------------------------------
        hhid |     55169    514703.2    315735.3       1005    1060074
     product |     54941    11503.54      247.74      11112      11782
  valued_tot |     54941    7.173119    14.17906          0   813.9857
quantityd_~t |     54941    .3895977    .7253671   .0002595   20.57143
     survmon |     55169    6.576356    3.438615          1         12
-------------+--------------------------------------------------------
    survquar |     55169    2.541427    1.115596          1          4
    hhweight |     55169    422.8249    390.6042   39.58433   8495.651
      hhsize |     55169    4.876235    2.514585          1         34
       rural |     55169    .4896772     .499898          0          1
        news |     55169    1.969566    .7980534          1          3
-------------+--------------------------------------------------------
     reg_tpi |     55169    3.449455    1.797849          1          6
      strata |     55169    5.624826    3.180569          1         11
    spdomain |     55169    6.452682    3.776662          1         13

. **************************************************************************;
. * Need to merge with the file that has nominal consumption per household,
> * and compute nominal consumption per capita from that, so that we can
> * choose the relatively poor (i.e., below median nominal consumption per
> * capita).
> **************************************************************************;
. use "$path\work\conpc.dta", clear;

. keep hhid cons_hh_nom;

. *use "$path/in/cons_cat.dta" ;
. *save "$path/work/cons_cat.dta", replace ;
. *use "$path/work/cons_cat.dta" ;
. *CA modified to merge in hhdata for bootstrap;
.        sort hhid;

.         merge hhid using "$path\work\hhdata.dta";

.           tab _m;

     _merge |      Freq.     Percent        Cum.
------------+-----------------------------------
          3 |     10,832      100.00      100.00
------------+-----------------------------------
      Total |     10,832      100.00

.  drop _m;

.         collapse (mean) cons_hh_nom hhsize hhweight , by(hhid);

.         gen cpc=cons_hh_nom/hhsize;

.         sum cpc [aw=hhsize*hhweight] , detail;

                             cpc
-------------------------------------------------------------
      Percentiles      Smallest
 1%     2.217581       .5010331
 5%     5.141517       .6294842
10%     6.588092       .7758194       Obs               10832
25%     10.19053       .8589561       Sum of Wgt.  21537187.8

50%     16.42623                      Mean           24.03431
                        Largest       Std. Dev.      38.76576
75%     26.60812       1583.719
90%     42.24796       1584.194       Variance       1502.784
95%     59.00286       1653.955       Skewness       20.50937
99%      149.504       4744.847       Kurtosis       1356.488

.         global medcpc=r(p$tpi_bottom);

.         gen bottom_tpi=cpc<=$medcpc;

.         keep hhid bottom_tpi;

.         sort hhid;

.         tempfile bottom_tpi;

. save `bottom_tpi', replace;
(note: file C:\Users\TEMPLE~1\AppData\Local\Temp\ST_0j000008.tmp not found)
file C:\Users\TEMPLE~1\AppData\Local\Temp\ST_0j000008.tmp saved

. sum;

    Variable |       Obs        Mean    Std. Dev.       Min        Max
-------------+--------------------------------------------------------
        hhid |     10832    543185.7    312349.5       1005    1060074
  bottom_tpi |     10832    .3779542    .4848985          0          1

. use `acredd' ;

.         merge hhid using `bottom_tpi';
variable hhid does not uniquely identify observations in the master data

.         tab _merge;

     _merge |      Freq.     Percent        Cum.
------------+-----------------------------------
          3 |     55,169      100.00      100.00
------------+-----------------------------------
      Total |     55,169      100.00

.         drop _merge;

.         keep if bottom_tpi;
(36300 observations deleted)

. sum;

    Variable |       Obs        Mean    Std. Dev.       Min        Max
-------------+--------------------------------------------------------
        hhid |     18869    446885.9    258373.3       1055    1060028
     product |     18738    11485.29    252.1348      11112      11782
  valued_tot |     18738    5.280588     8.24401          0      112.3
quantityd_~t |     18738    .3793513    .6772446   .0002595      14.28
     survmon |     18869    6.645821    3.408422          1         12
-------------+--------------------------------------------------------
    survquar |     18869    2.547724    1.116831          1          4
    hhweight |     18869    493.7233     499.172   39.58433   8495.651
      hhsize |     18869    5.655096    2.353232          1         23
       rural |     18869      .63077    .4826091          0          1
        news |     18869    1.814564    .7201835          1          3
-------------+--------------------------------------------------------
     reg_tpi |     18869    2.998357    1.565998          1          6
      strata |     18869    4.835232    2.525729          1         11
    spdomain |     18869     5.46897    2.877241          1         13
  bottom_tpi |     18869           1           0          1          1

. * Drop one HH with extremely high quantity and low value in IAF 2002/03 (t=t1) ;
. *        drop if hhid==263001;
.         preserve;

.                 collapse (sum) valued_tot quantityd_tot [aw=hhweight] , 
>                                 by(reg_tpi news product survmon);

.                         drop if product==.;
(51 observations deleted)

.                         gen ppkg=valued_tot/quantityd_tot;

.                         lab var ppkg "Unit value per kg";

.                         sort reg_tpi product ;

.                         compress;

.                         tempfile uvm;

.                 save `uvm', replace;
(note: file C:\Users\TEMPLE~1\AppData\Local\Temp\ST_0j00000a.tmp not found)
file C:\Users\TEMPLE~1\AppData\Local\Temp\ST_0j00000a.tmp saved

.                 save "$path/work/tpi_unit_val_monthly.dta", replace;
file C:\Users\Templeton\Desktop\GAPP\GAPP-UGANDA-HARUNA\ww-ug\10_MZ/work/tpi_unit_val_month
> ly.dta saved

.         restore;

.         preserve;

.                 collapse (sum) valued_tot quantityd_tot [aw=hhweight] , 
>                                 by(reg_tpi news product survquar);

.                         drop if product==.;
(21 observations deleted)

.                         gen ppkg=valued_tot/quantityd_tot;

.                         sort reg_tpi product survquar;

.                         list in  1/3;

     +------------------------------------------------------------------------------+
  1. | product |   survquar |                                   news |      reg_tpi |
     |   11112 | Sep-Nov 08 | North:   Niassa, Cabo Delgado, Nampula | North  Rural |
     |------------------------------------------------------------------------------|
     |        valued~t         |        quanti~t         |             ppkg         |
     |        195.8465         |        7.243705         |         27.03679         |
     +------------------------------------------------------------------------------+

     +------------------------------------------------------------------------------+
  2. | product |   survquar |                                   news |      reg_tpi |
     |   11112 | Dec-Feb 09 | North:   Niassa, Cabo Delgado, Nampula | North  Rural |
     |------------------------------------------------------------------------------|
     |        valued~t         |        quanti~t         |             ppkg         |
     |        90.02953         |        3.611564         |         24.92813         |
     +------------------------------------------------------------------------------+

     +------------------------------------------------------------------------------+
  3. | product |   survquar |                                   news |      reg_tpi |
     |   11112 | Mar-May 09 | North:   Niassa, Cabo Delgado, Nampula | North  Rural |
     |------------------------------------------------------------------------------|
     |        valued~t         |        quanti~t         |             ppkg         |
     |        262.8266         |        10.56129         |         24.88584         |
     +------------------------------------------------------------------------------+

.                         list in -3/-1;

     +-------------------------------------------------------------------------------+
357. | product |   survquar |                                    news |      reg_tpi |
     |   11782 | Dec-Feb 09 | South:   Gaza, Inha, Map Prov, Map City | South  Urban |
     |-------------------------------------------------------------------------------|
     |        valued~t         |         quanti~t         |             ppkg         |
     |        67.75916         |         11.06728         |         6.122477         |
     +-------------------------------------------------------------------------------+

     +-------------------------------------------------------------------------------+
358. | product |   survquar |                                    news |      reg_tpi |
     |   11782 | Mar-May 09 | South:   Gaza, Inha, Map Prov, Map City | South  Urban |
     |-------------------------------------------------------------------------------|
     |        valued~t         |         quanti~t         |             ppkg         |
     |        128.0858         |         20.08877         |         6.375993         |
     +-------------------------------------------------------------------------------+

     +-------------------------------------------------------------------------------+
359. | product |   survquar |                                    news |      reg_tpi |
     |   11782 | Jun-Aug 09 | South:   Gaza, Inha, Map Prov, Map City | South  Urban |
     |-------------------------------------------------------------------------------|
     |        valued~t         |         quanti~t         |             ppkg         |
     |        237.2222         |         32.55453         |         7.286919         |
     +-------------------------------------------------------------------------------+

.                         tempfile uvq;

.                 save "$path/work/tpi_unit_val_quarterly.dta", replace;
file C:\Users\Templeton\Desktop\GAPP\GAPP-UGANDA-HARUNA\ww-ug\10_MZ/work/tpi_unit_val_quart
> erly.dta saved

.                 save `uvq', replace;
(note: file C:\Users\TEMPLE~1\AppData\Local\Temp\ST_0j00000c.tmp not found)
file C:\Users\TEMPLE~1\AppData\Local\Temp\ST_0j00000c.tmp saved

.         restore;

.         **************************************************************************;
. * Toss out the bottom 5% and top 5% of the HH-LEVEL prices per kg in
> * each reg_tpi & product combination. This should eliminate outliers that
> * may have an undue influence on the price calculation. Then use sample
> * weighting PLUS quantity weighting on those HH-level observations.
> **************************************************************************;
.         preserve;

.                 gen hhppkg=valued_tot/quantityd_tot;
(131 missing values generated)

.                 egen lower5=pctile(hhppkg), p(5) by(reg_tpi product);
(131 missing values generated)

.                 egen upper5=pctile(hhppkg), p(95) by(reg_tpi product);
(131 missing values generated)

.                 keep if hhppkg>=lower5 & hhppkg<=upper5;
(1638 observations deleted)

.                                 gen hhqtywt=hhweight*quantityd_tot;
(131 missing values generated)

.                                 collapse (sum) valued_tot quantityd_tot [aw=hhqtywt] , 
>                                 by(reg_tpi news product survquar);

.                         drop if product==.;
(0 observations deleted)

.                         gen ppkg_trim=valued_tot/quantityd_tot;

.                         lab var ppkg_trim "90% trimmed unit value per kg";

.                         sort reg_tpi product survquar;

.                         list , nol;

     +----------------------------------------------------------------------+
     | product   survquar   news   reg_tpi   valued~t   quanti~t   ppkg_t~m |
     |----------------------------------------------------------------------|
  1. |   11112          1      1         1   289.9228   10.70453   27.08414 |
  2. |   11112          2      1         1   81.14131   2.857354   28.39736 |
  3. |   11112          3      1         1   425.1042   19.12059    22.2328 |
  4. |   11112          4      1         1   782.5064   34.36068   22.77331 |
  5. |   11121          1      1         1   241.7332   27.97836   8.640005 |
     |----------------------------------------------------------------------|
  6. |   11121          2      1         1   183.5358   17.33219    10.5893 |
  7. |   11121          3      1         1   32.26865   7.789902    4.14237 |
  8. |   11121          4      1         1   131.7045    25.2102   5.224255 |
  9. |   11141          1      1         1   1450.482   104.5072   13.87925 |
 10. |   11141          2      1         1   2083.063    112.669   18.48835 |
     |----------------------------------------------------------------------|
 11. |   11141          3      1         1   3135.313   262.8145   11.92975 |
 12. |   11141          4      1         1   2415.612   180.2213   13.40359 |
 13. |   11146          1      1         1   2615.862   320.0817   8.172481 |
 14. |   11146          2      1         1   1987.484   207.7264   9.567797 |
 15. |   11146          3      1         1   1328.637   119.1731    11.1488 |
     |----------------------------------------------------------------------|
 16. |   11146          4      1         1    1415.91   143.6192   9.858778 |
 17. |   11279          1      1         1   491.1455   5.855615   83.87598 |
 18. |   11279          2      1         1   206.6044   2.409121   85.75924 |
 19. |   11279          3      1         1   185.0326   2.019489   91.62346 |
 20. |   11279          4      1         1   304.3386   3.043697   99.98978 |
     |----------------------------------------------------------------------|
 21. |   11311          1      1         1   725.2583   19.36606   37.44997 |
 22. |   11311          2      1         1   353.1074   12.02126   29.37358 |
 23. |   11311          3      1         1    639.117   37.48585   17.04955 |
 24. |   11311          4      1         1   176.2849   6.265709   28.13487 |
 25. |   11361          1      1         1   893.2202    16.1789   55.20895 |
     |----------------------------------------------------------------------|
 26. |   11361          2      1         1   878.2652    13.8169   63.56455 |
 27. |   11361          3      1         1   318.7938   4.809543   66.28358 |
 28. |   11361          4      1         1   779.4923   11.45018   68.07685 |
 29. |   11541          1      1         1   207.1932   3.264923   63.46038 |
 30. |   11541          2      1         1    140.962   2.217038   63.58123 |
     |----------------------------------------------------------------------|
 31. |   11541          3      1         1   253.3816   4.005778   63.25404 |
 32. |   11541          4      1         1   252.3182   4.592608   54.94006 |
 33. |   11674          1      1         1   408.3686   15.02243   27.18392 |
 34. |   11674          2      1         1   651.8139   22.26195   29.27928 |
 35. |   11674          3      1         1   2004.576     118.54   16.91055 |
     |----------------------------------------------------------------------|
 36. |   11674          4      1         1   477.8671   25.02279   19.09728 |
 37. |   11676          1      1         1   22.85485   3.973496   5.751824 |
 38. |   11676          2      1         1   59.82564   14.70191   4.069243 |
 39. |   11676          3      1         1   78.04182   12.75289   6.119539 |
 40. |   11676          4      1         1   82.05285   13.33376   6.153769 |
     |----------------------------------------------------------------------|
 41. |   11712          1      1         1   49.96798   4.398956   11.35906 |
 42. |   11712          2      1         1   151.5249   16.95407   8.937374 |
 43. |   11712          3      1         1   311.6583   29.11089    10.7059 |
 44. |   11712          4      1         1   64.86541   4.976528   13.03427 |
 45. |   11731          1      1         1   201.6521   30.89507   6.526999 |
     |----------------------------------------------------------------------|
 46. |   11731          2      1         1   28.85673   2.659837   10.84906 |
 47. |   11731          3      1         1   117.2299   18.51937   6.330122 |
 48. |   11731          4      1         1    137.438   18.23683   7.536286 |
 49. |   11751          1      1         1   94.51731   4.444927   21.26409 |
 50. |   11751          2      1         1   33.83137   1.544979   21.89762 |
     |----------------------------------------------------------------------|
 51. |   11751          3      1         1   69.43633   2.740529   25.33684 |
 52. |   11751          4      1         1   13.87673   1.092743   12.69898 |
 53. |   11752          1      1         1   473.0144   34.04796   13.89259 |
 54. |   11752          2      1         1      324.6   15.50794   20.93122 |
 55. |   11752          3      1         1   560.5316   62.29652   8.997801 |
     |----------------------------------------------------------------------|
 56. |   11752          4      1         1   690.9097   75.24593   9.182022 |
 57. |   11782          1      1         1   248.2492   58.28859   4.258967 |
 58. |   11782          2      1         1   136.7498   26.68324   5.124932 |
 59. |   11782          3      1         1   402.6538    99.6117   4.042234 |
 60. |   11782          4      1         1   412.3931   81.44523    5.06344 |
     |----------------------------------------------------------------------|
 61. |   11112          1      1         2   224.3665   8.888641   25.24194 |
 62. |   11112          2      1         2   525.6236   18.73001   28.06317 |
 63. |   11112          3      1         2   172.0386   6.789147   25.34024 |
 64. |   11112          4      1         2   464.9977   21.05975   22.07993 |
 65. |   11121          1      1         2   22.00354   4.367449   5.038078 |
     |----------------------------------------------------------------------|
 66. |   11121          2      1         2   54.14616   5.996189   9.030095 |
 67. |   11121          3      1         2   64.71153   12.32394   5.250882 |
 68. |   11121          4      1         2   15.85888   3.423992   4.631693 |
 69. |   11141          1      1         2   939.3127   51.68785   18.17279 |
 70. |   11141          2      1         2   659.3004   44.99243   14.65359 |
     |----------------------------------------------------------------------|
 71. |   11141          3      1         2   873.6347   71.48425   12.22136 |
 72. |   11141          4      1         2   981.9993   82.03045   11.97116 |
 73. |   11146          1      1         2   499.8388   52.16203   9.582427 |
 74. |   11146          2      1         2   589.7454   95.34653   6.185284 |
 75. |   11146          3      1         2   578.3034   50.03462   11.55807 |
     |----------------------------------------------------------------------|
 76. |   11146          4      1         2   397.0798   40.25937   9.863041 |
 77. |   11279          1      1         2   298.6358   2.585774   115.4918 |
 78. |   11279          2      1         2   54.12273   .8566281   63.18113 |
 79. |   11279          3      1         2   30.89898   .3586286   86.15872 |
 80. |   11279          4      1         2   135.8239   1.468514    92.4907 |
     |----------------------------------------------------------------------|
 81. |   11311          1      1         2   140.3637   3.606761   38.91683 |
 82. |   11311          2      1         2   303.0966   7.142073   42.43819 |
 83. |   11311          3      1         2   254.2492   13.18414   19.28447 |
 84. |   11311          4      1         2   165.0833   4.448439   37.11038 |
 85. |   11361          1      1         2   314.2141   5.265474   59.67442 |
     |----------------------------------------------------------------------|
 86. |   11361          2      1         2   317.5227   4.008833   79.20576 |
 87. |   11361          3      1         2   425.8655   6.764453   62.95638 |
 88. |   11361          4      1         2   354.7148    4.97839   71.25091 |
 89. |   11541          1      1         2   141.0942   2.891906   48.78936 |
 90. |   11541          2      1         2   148.0258   2.862417   51.71355 |
     |----------------------------------------------------------------------|
 91. |   11541          3      1         2   139.1682   2.489723   55.89708 |
 92. |   11541          4      1         2   402.6463   8.677448   46.40147 |
 93. |   11674          1      1         2   174.6409   6.818322   25.61347 |
 94. |   11674          2      1         2   375.9655   22.91269   16.40861 |
 95. |   11674          3      1         2   299.4088     20.894   14.32989 |
     |----------------------------------------------------------------------|
 96. |   11674          4      1         2   285.0377    12.2222   23.32131 |
 97. |   11676          1      1         2   31.21055   3.114796    10.0201 |
 98. |   11676          2      1         2    38.0434   4.969578   7.655257 |
 99. |   11676          3      1         2   37.64577   10.13681    3.71377 |
100. |   11676          4      1         2   23.30514    3.11325   7.485794 |
     |----------------------------------------------------------------------|
101. |   11712          1      1         2   13.37557   1.060871    12.6081 |
102. |   11712          2      1         2   126.1812   13.32777   9.467544 |
103. |   11712          3      1         2   183.9068   13.17097   13.96304 |
104. |   11712          4      1         2   28.01613   2.001662   13.99644 |
105. |   11731          1      1         2   173.8532   11.43595   15.20235 |
     |----------------------------------------------------------------------|
106. |   11731          2      1         2     37.657   2.076143   18.13796 |
107. |   11731          3      1         2   90.06455   5.606901   16.06316 |
108. |   11731          4      1         2   128.0569   9.868159   12.97678 |
109. |   11751          1      1         2   99.14073   4.016458   24.68362 |
110. |   11751          2      1         2   149.4409   4.324505   34.55676 |
     |----------------------------------------------------------------------|
111. |   11751          3      1         2   125.2196   4.834861   25.89931 |
112. |   11751          4      1         2   104.3331   4.753748   21.94754 |
113. |   11752          1      1         2   127.5686   9.543753   13.36671 |
114. |   11752          2      1         2    203.545   8.736641   23.29785 |
115. |   11752          3      1         2   128.4038   16.69848   7.689551 |
     |----------------------------------------------------------------------|
116. |   11752          4      1         2   231.4453   16.98924   13.62305 |
117. |   11782          1      1         2   111.8067   17.69077   6.320061 |
118. |   11782          2      1         2   136.8463   16.69703   8.195847 |
119. |   11782          3      1         2   220.3845   35.85852   6.145945 |
120. |   11782          4      1         2   117.4668   20.68004   5.680199 |
     |----------------------------------------------------------------------|
121. |   11112          1      2         3   1051.017   76.78339   13.68808 |
122. |   11112          2      2         3   741.4427   34.51683   21.48061 |
123. |   11112          3      2         3   1227.227   65.52485   18.72918 |
124. |   11112          4      2         3   1390.632   94.86352   14.65929 |
125. |   11121          1      2         3   852.1517   91.83456   9.279205 |
     |----------------------------------------------------------------------|
126. |   11121          2      2         3   1427.964   123.2106   11.58962 |
127. |   11121          3      2         3   915.6143   168.7491   5.425892 |
128. |   11121          4      2         3   278.5576      50.63   5.501828 |
129. |   11141          1      2         3     4100.2   218.1379   18.79636 |
130. |   11141          2      2         3   4814.864   211.0091   22.81828 |
     |----------------------------------------------------------------------|
131. |   11141          3      2         3   6770.883   455.7047   14.85805 |
132. |   11141          4      2         3   4761.484   300.8787   15.82526 |
133. |   11146          1      2         3    2122.59   168.0837   12.62818 |
134. |   11146          2      2         3   2099.675   149.9606   14.00151 |
135. |   11146          3      2         3   1864.547   122.9455   15.16564 |
     |----------------------------------------------------------------------|
136. |   11146          4      2         3   2464.101   211.4653   11.65251 |
137. |   11279          1      2         3   483.5573    5.67843   85.15686 |
138. |   11279          2      2         3   589.4203   8.772514   67.18944 |
139. |   11279          3      2         3   481.1174   6.057762   79.42164 |
140. |   11279          4      2         3   407.8509   4.642976   87.84256 |
     |----------------------------------------------------------------------|
141. |   11311          1      2         3   466.2856   19.15734   24.33979 |
142. |   11311          2      2         3    532.874   26.48836   20.11729 |
143. |   11311          3      2         3   494.9148    40.7456   12.14646 |
144. |   11311          4      2         3   220.3874   10.10593   21.80773 |
145. |   11361          1      2         3   1196.596   20.32831   58.86353 |
     |----------------------------------------------------------------------|
146. |   11361          2      2         3    563.423   10.66161   52.84597 |
147. |   11361          3      2         3    1161.29    21.4175   54.22155 |
148. |   11361          4      2         3   550.2962   10.11105   54.42522 |
149. |   11541          1      2         3   350.0498   6.516499   53.71746 |
150. |   11541          2      2         3   300.2968   5.020881   59.80958 |
     |----------------------------------------------------------------------|
151. |   11541          3      2         3   486.2242   10.38241   46.83151 |
152. |   11541          4      2         3   327.2811     5.6886    57.5328 |
153. |   11674          1      2         3   45.33889   2.966435   15.28397 |
154. |   11674          2      2         3   99.60603   4.082514   24.39821 |
155. |   11674          3      2         3    468.577   43.67042   10.72985 |
     |----------------------------------------------------------------------|
156. |   11674          4      2         3   189.2801   6.518829   29.03591 |
157. |   11676          1      2         3   133.2248   54.03008   2.465753 |
158. |   11676          2      2         3   207.6736   100.2844   2.070845 |
159. |   11676          3      2         3   212.7432   100.4323   2.118275 |
160. |   11676          4      2         3   103.0396   34.29518   3.004493 |
     |----------------------------------------------------------------------|
161. |   11712          1      2         3   82.92306    11.0271   7.519931 |
162. |   11712          2      2         3   764.1288   99.70593   7.663826 |
163. |   11712          3      2         3   487.5651   76.98276   6.333433 |
164. |   11712          4      2         3    123.834   18.67208   6.632041 |
165. |   11731          1      2         3   324.2155   47.03403   6.893212 |
     |----------------------------------------------------------------------|
166. |   11731          2      2         3   110.8923    8.30754    13.3484 |
167. |   11731          3      2         3   279.2783   24.39364   11.44882 |
168. |   11731          4      2         3   318.8822   27.58011   11.56204 |
169. |   11751          1      2         3   183.7224   7.245253   25.35762 |
170. |   11751          2      2         3   324.2325    8.10084   40.02455 |
     |----------------------------------------------------------------------|
171. |   11751          3      2         3   445.4892   15.57769    28.5979 |
172. |   11751          4      2         3   227.8686   11.45836   19.88667 |
173. |   11752          1      2         3   147.5581   7.829923   18.84541 |
174. |   11752          2      2         3   164.7093   10.99128   14.98545 |
175. |   11752          3      2         3   704.5901   33.97975   20.73559 |
     |----------------------------------------------------------------------|
176. |   11752          4      2         3   336.7138   20.51622   16.41208 |
177. |   11782          1      2         3   130.8187   35.72999   3.661313 |
178. |   11782          2      2         3   98.41739   28.40309   3.465024 |
179. |   11782          3      2         3   458.9807   84.62772   5.423527 |
180. |   11782          4      2         3   183.6333   64.35742   2.853335 |
     |----------------------------------------------------------------------|
181. |   11112          1      2         4    628.608   30.35489   20.70863 |
182. |   11112          2      2         4   1009.679   46.63996   21.64837 |
183. |   11112          3      2         4   1190.894   51.29862   23.21493 |
184. |   11112          4      2         4   409.3236   21.08854   19.40976 |
185. |   11121          1      2         4   427.4591   38.96789   10.96952 |
     |----------------------------------------------------------------------|
186. |   11121          2      2         4   370.1504    24.5286   15.09056 |
187. |   11121          3      2         4   230.7739   53.97893   4.275259 |
188. |   11121          4      2         4    174.705   21.81776   8.007464 |
189. |   11141          1      2         4   897.5834   56.36237   15.92523 |
190. |   11141          2      2         4    1649.21   88.54684   18.62528 |
     |----------------------------------------------------------------------|
191. |   11141          3      2         4   2201.835   143.4734   15.34665 |
192. |   11141          4      2         4   1265.323   81.07293   15.60722 |
193. |   11146          1      2         4   303.7105    12.1794   24.93641 |
194. |   11146          2      2         4   620.4647   51.18239   12.12262 |
195. |   11146          3      2         4   174.7044   8.040014   21.72937 |
     |----------------------------------------------------------------------|
196. |   11146          4      2         4   72.10461   4.929617   14.62682 |
197. |   11279          1      2         4   128.4787   1.506292   85.29466 |
198. |   11279          2      2         4   43.95919   .4781714   91.93185 |
199. |   11279          3      2         4    82.6952   1.114511   74.19864 |
200. |   11279          4      2         4   61.04719   .6085178   100.3211 |
     |----------------------------------------------------------------------|
201. |   11311          1      2         4   517.7292   19.14764   27.03881 |
202. |   11311          2      2         4   423.0085   12.42738   34.03844 |
203. |   11311          3      2         4   590.4068   19.33865   30.52988 |
204. |   11311          4      2         4   287.4893   9.320323   30.84542 |
205. |   11361          1      2         4   437.6712   12.05209   36.31496 |
     |----------------------------------------------------------------------|
206. |   11361          2      2         4   477.9151   10.35514   46.15245 |
207. |   11361          3      2         4   289.2004   6.658032   43.43633 |
208. |   11361          4      2         4   280.9135   5.631651   49.88119 |
209. |   11541          1      2         4   321.7056   6.935634   46.38445 |
210. |   11541          2      2         4   379.8896   7.554423   50.28704 |
     |----------------------------------------------------------------------|
211. |   11541          3      2         4   273.6866   6.543707   41.82439 |
212. |   11541          4      2         4   306.2746   5.858217    52.2812 |
213. |   11674          1      2         4    68.5785   10.98965    6.24028 |
214. |   11674          2      2         4   53.05155   1.666772   31.82892 |
215. |   11674          3      2         4   451.6418   20.14819     22.416 |
     |----------------------------------------------------------------------|
216. |   11674          4      2         4   51.32302   1.455876   35.25232 |
217. |   11676          1      2         4   97.28958   26.17459   3.716948 |
218. |   11676          2      2         4   146.3429   38.79868   3.771853 |
219. |   11676          3      2         4   94.03158    31.7713   2.959639 |
220. |   11676          4      2         4   102.4909   18.74949    5.46633 |
     |----------------------------------------------------------------------|
221. |   11712          1      2         4   41.37637   4.641704   8.914048 |
222. |   11712          2      2         4   97.32725   15.27652   6.371034 |
223. |   11712          3      2         4   113.3323   13.36604   8.479121 |
224. |   11712          4      2         4   37.67598   4.569603   8.244912 |
225. |   11731          1      2         4   233.4253   24.17583   9.655317 |
     |----------------------------------------------------------------------|
226. |   11731          2      2         4   193.0941   9.795726   19.71207 |
227. |   11731          3      2         4   127.9586   10.59814   12.07369 |
228. |   11731          4      2         4   185.4356   15.45275   12.00017 |
229. |   11751          1      2         4   244.3143   11.36032   21.50594 |
230. |   11751          2      2         4   485.7201   14.24211    34.1045 |
     |----------------------------------------------------------------------|
231. |   11751          3      2         4    190.799   6.800239   28.05769 |
232. |   11751          4      2         4   246.2702   12.95321   19.01229 |
233. |   11752          1      2         4   48.49636   2.966255   16.34935 |
234. |   11752          2      2         4   57.25472   2.494085    22.9562 |
235. |   11752          3      2         4   170.0302   9.486404   17.92356 |
     |----------------------------------------------------------------------|
236. |   11752          4      2         4   116.6871   7.274723   16.04008 |
237. |   11782          1      2         4   22.26254   4.337011   5.133153 |
238. |   11782          2      2         4   53.01994   7.308951   7.254111 |
239. |   11782          3      2         4   83.12976   12.72356   6.533532 |
240. |   11782          4      2         4   26.41292   5.640313   4.682881 |
     |----------------------------------------------------------------------|
241. |   11112          1      3         5   614.0324   25.83444   23.76797 |
242. |   11112          2      3         5   611.0475   29.15088   20.96155 |
243. |   11112          3      3         5   327.7572   15.94932   20.54992 |
244. |   11112          4      3         5    267.784   13.86387   19.31524 |
245. |   11121          1      3         5   569.3302   45.01038   12.64887 |
     |----------------------------------------------------------------------|
246. |   11121          2      3         5   142.5503   7.700626   18.51153 |
247. |   11121          3      3         5   424.1908   65.77295    6.44932 |
248. |   11121          4      3         5   1521.201   135.5127   11.22553 |
249. |   11141          1      3         5   812.3484   49.15675   16.52567 |
250. |   11141          2      3         5   751.1703   42.46918   17.68742 |
     |----------------------------------------------------------------------|
251. |   11141          3      3         5   235.3682   11.31628   20.79909 |
252. |   11141          4      3         5   192.8576    8.65915   22.27212 |
253. |   11146          1      3         5   6.093566    .493887   12.33798 |
254. |   11146          2      3         5   56.04482   2.190005   25.59118 |
255. |   11146          3      3         5   10.31429   .3714285   27.76923 |
     |----------------------------------------------------------------------|
256. |   11279          1      3         5   57.16628   .5977143   95.64149 |
257. |   11279          2      3         5   73.01481    .685326   106.5403 |
258. |   11279          3      3         5   97.07585    1.10688   87.70223 |
259. |   11279          4      3         5   163.6004     1.6331   100.1778 |
260. |   11311          1      3         5   209.5675   5.986698   35.00552 |
     |----------------------------------------------------------------------|
261. |   11311          2      3         5   95.96226   4.731346   20.28223 |
262. |   11311          3      3         5   168.4391   7.151455   23.55312 |
263. |   11311          4      3         5   169.9531   11.87225   14.31515 |
264. |   11361          1      3         5   115.1049   2.536891   45.37244 |
265. |   11361          2      3         5    11.5166   .6098741   18.88357 |
     |----------------------------------------------------------------------|
266. |   11361          3      3         5   90.98601   6.049279    15.0408 |
267. |   11361          4      3         5   37.42099   3.455806   10.82844 |
268. |   11541          1      3         5   68.06467   1.076143    63.2487 |
269. |   11541          2      3         5   62.77808   1.528993   41.05844 |
270. |   11541          3      3         5   34.21586   .5791583   59.07861 |
     |----------------------------------------------------------------------|
271. |   11541          4      3         5   46.80851   .5837049   80.19208 |
272. |   11674          1      3         5   510.3023   14.27575    35.7461 |
273. |   11674          2      3         5   517.4157    12.0932   42.78566 |
274. |   11674          3      3         5    365.603   9.463389   38.63342 |
275. |   11674          4      3         5   377.7275   10.09255   37.42638 |
     |----------------------------------------------------------------------|
276. |   11676          1      3         5   206.2536   105.2249   1.960121 |
277. |   11676          2      3         5   751.2339   246.4344   3.048413 |
278. |   11676          3      3         5   336.1688   134.4521   2.500286 |
279. |   11676          4      3         5   233.2394   110.0717   2.118977 |
280. |   11712          1      3         5   197.0034   16.97574   11.60499 |
     |----------------------------------------------------------------------|
281. |   11712          2      3         5   549.6493   70.22327   7.827168 |
282. |   11712          3      3         5   334.6864   43.60846   7.674803 |
283. |   11712          4      3         5   225.1014   24.68156   9.120226 |
284. |   11731          1      3         5   379.7201   30.52841   12.43825 |
285. |   11731          2      3         5     74.168   5.318463   13.94538 |
     |----------------------------------------------------------------------|
286. |   11731          3      3         5   13.24619   .6955384   19.04451 |
287. |   11731          4      3         5   52.24713    4.57179   11.42816 |
288. |   11751          1      3         5     24.635   .5714286   43.11124 |
289. |   11751          2      3         5    30.7083   .9314634    32.9678 |
290. |   11751          3      3         5   24.96143   .5250408   47.54189 |
     |----------------------------------------------------------------------|
291. |   11751          4      3         5   15.40746   .4578558   33.65134 |
292. |   11752          1      3         5   39.11056   1.589871   24.59982 |
293. |   11752          2      3         5   27.31277   .9857252   27.70831 |
294. |   11752          3      3         5   634.9971   29.57443   21.47115 |
295. |   11752          4      3         5   606.4254   28.39948    21.3534 |
     |----------------------------------------------------------------------|
296. |   11782          1      3         5   289.3636   49.36998   5.861125 |
297. |   11782          2      3         5   414.0912   52.22778   7.928563 |
298. |   11782          3      3         5   385.1543   52.63254   7.317798 |
299. |   11782          4      3         5   857.8461   163.4997   5.246774 |
300. |   11112          1      3         6   989.0091   47.64331   20.75861 |
     |----------------------------------------------------------------------|
301. |   11112          2      3         6   746.4491   35.59225   20.97224 |
302. |   11112          3      3         6   680.2972   33.45914   20.33218 |
303. |   11112          4      3         6   408.4662    19.4186    21.0348 |
304. |   11121          1      3         6   105.0353   7.752721   13.54818 |
305. |   11121          2      3         6   70.90808   4.970638   14.26539 |
     |----------------------------------------------------------------------|
306. |   11121          3      3         6    181.168   19.26558   9.403715 |
307. |   11121          4      3         6   29.07048   2.301175   12.63289 |
308. |   11141          1      3         6   305.3726   14.37366    21.2453 |
309. |   11141          2      3         6   123.4364   6.006642   20.54998 |
310. |   11141          3      3         6   229.5539    12.3689   18.55896 |
     |----------------------------------------------------------------------|
311. |   11141          4      3         6    185.288   8.882044   20.86097 |
312. |   11146          1      3         6   29.17603   2.472425   11.80057 |
313. |   11146          2      3         6          1   .4285714   2.333333 |
314. |   11146          3      3         6   4.285714   .1880623    22.7888 |
315. |   11146          4      3         6          2   .0422857    47.2973 |
     |----------------------------------------------------------------------|
316. |   11279          1      3         6   49.82366   .4314983   115.4666 |
317. |   11279          2      3         6   92.62517   .7172572    129.138 |
318. |   11279          3      3         6   74.88369   .7532498   99.41415 |
319. |   11279          4      3         6     37.291   .3586286   103.9822 |
320. |   11311          1      3         6   91.28411   2.358614   38.70244 |
     |----------------------------------------------------------------------|
321. |   11311          2      3         6   92.37657   2.947272   31.34307 |
322. |   11311          3      3         6    230.383   6.764693   34.05667 |
323. |   11311          4      3         6   151.7289   3.460512    43.8458 |
324. |   11361          1      3         6   54.46763   1.636561   33.28175 |
325. |   11361          2      3         6   1.428571   .0542857   26.31579 |
     |----------------------------------------------------------------------|
326. |   11361          3      3         6   32.80397   .7065465   46.42861 |
327. |   11361          4      3         6   19.69857   .3593939   54.81054 |
328. |   11541          1      3         6   182.7276   2.917274   62.63641 |
329. |   11541          2      3         6   175.8114   3.075629   57.16275 |
330. |   11541          3      3         6    198.927   3.246676   61.27096 |
     |----------------------------------------------------------------------|
331. |   11541          4      3         6   98.61856   1.780032   55.40269 |
332. |   11674          1      3         6   461.7266   11.90886   38.77168 |
333. |   11674          2      3         6   457.1184   10.43018   43.82652 |
334. |   11674          3      3         6   707.7823   13.97851   50.63361 |
335. |   11674          4      3         6   244.6621   5.808577   42.12083 |
     |----------------------------------------------------------------------|
336. |   11676          1      3         6   328.4286   116.2986   2.824013 |
337. |   11676          2      3         6   322.9525   132.6472   2.434672 |
338. |   11676          3      3         6    344.556   119.6484   2.879738 |
339. |   11676          4      3         6   163.2352   60.58092   2.694499 |
340. |   11712          1      3         6   144.4135   12.30981   11.73158 |
     |----------------------------------------------------------------------|
341. |   11712          2      3         6   130.3599   12.30877   10.59081 |
342. |   11712          3      3         6     124.95   18.47794   6.762117 |
343. |   11712          4      3         6   60.22519   6.315687    9.53581 |
344. |   11731          1      3         6   181.9057   12.76737   14.24771 |
345. |   11731          2      3         6   187.6301    9.80497   19.13623 |
     |----------------------------------------------------------------------|
346. |   11731          3      3         6   141.7498   7.004155   20.23797 |
347. |   11731          4      3         6   155.6714   9.227022   16.87125 |
348. |   11751          1      3         6   126.5591   3.022198   41.87652 |
349. |   11751          2      3         6   190.9744    4.77448     39.999 |
350. |   11751          3      3         6   106.9588   2.782727   38.43668 |
     |----------------------------------------------------------------------|
351. |   11751          4      3         6   26.67005   .6935397   38.45497 |
352. |   11752          1      3         6   3.370089   .1808457   18.63516 |
353. |   11752          2      3         6   16.26168   .6479696   25.09636 |
354. |   11752          3      3         6   138.6928   7.981036    17.3778 |
355. |   11752          4      3         6   81.27848   4.157273   19.55091 |
     |----------------------------------------------------------------------|
356. |   11782          1      3         6   147.3491   25.47457   5.784164 |
357. |   11782          2      3         6   89.19679   14.61241    6.10418 |
358. |   11782          3      3         6   194.0931   42.71984   4.543394 |
359. |   11782          4      3         6   331.3009   53.82001   6.155719 |
     +----------------------------------------------------------------------+

.                         tempfile uvq2;

.                         keep reg_tpi product survquar ppkg_trim;

.                 save `uvq2', replace;
(note: file C:\Users\TEMPLE~1\AppData\Local\Temp\ST_0j00000e.tmp not found)
file C:\Users\TEMPLE~1\AppData\Local\Temp\ST_0j00000e.tmp saved

.                                 use `uvq' ;

.                         merge reg_tpi product survquar using `uvq2';
(label news_ru_ur already defined)
(label survquar already defined)

.                         tab _merge;

     _merge |      Freq.     Percent        Cum.
------------+-----------------------------------
          3 |        359      100.00      100.00
------------+-----------------------------------
      Total |        359      100.00

.                         drop _merge;

.                 save `uvq', replace;
file C:\Users\TEMPLE~1\AppData\Local\Temp\ST_0j00000c.tmp saved

.                 save "$path/work/tpi_unit_val_quarterly.dta", replace;
file C:\Users\Templeton\Desktop\GAPP\GAPP-UGANDA-HARUNA\ww-ug\10_MZ/work/tpi_unit_val_quart
> erly.dta saved

.         restore;

. **************************************************************************;
. * Now calculate the weights for the temporal price index. The weights
> * will be based on the bottom 50% of the national nominal consumption
> * per capita (see below). We let the weights vary by strata (3 regions X rural/urban).
> *
> * First, make a small file that has the total nominal HH daily consumption,
> * to use as our denominator. We cannot simply use the `bottom_tpi' file that
> * was created earlier because we will need some other variables from
> * the cons_cat.dta file.
> **************************************************************************;
. use "$path\work\conpc.dta", clear;

. keep hhid cons_hh_nom;

. *use "$path/in/cons_cat.dta", clear ;
. *CA modified to merge in hhdata for bootstrap;
.        sort hhid;

.         merge hhid using "$path\work\hhdata.dta";

.           tab _m;

     _merge |      Freq.     Percent        Cum.
------------+-----------------------------------
          3 |     10,832      100.00      100.00
------------+-----------------------------------
      Total |     10,832      100.00

.         collapse (mean) cons_hh_nom hhsize strata hhweight rural news survquar reg_tpi,
>                 by(hhid);

.         lab var cons_hh_nom "Nominal daily HH consumption";

.         rename hhsize   cc_hhs;

.         rename strata   cc_reg;

.         rename hhweight cc_hhw;

.         rename rural    cc_rur;

.         rename news     cc_news;

.         rename survquar cc_qua;

.         rename reg_tpi  cc_reg_tpi;

.         sort hhid;

.         tempfile thhcons;

. save `thhcons', replace;
(note: file C:\Users\TEMPLE~1\AppData\Local\Temp\ST_0j00000f.tmp not found)
file C:\Users\TEMPLE~1\AppData\Local\Temp\ST_0j00000f.tmp saved

. **************************************************************************;
. * Merge the file with consumption on the food products with HH consumption file,
> * then use "fillin" to take care of cases where a household did not
> * consume all n_tpi commodities. Note that we need to do the merge
> * first because there are some households that are not in `acredd' at
> * all, because they did not consume *any* of the n_tpi items. Then replace
> * missing values in the "filled in" observations with the relevant values 
> * for that household.
> **************************************************************************;
. use `acredd';

.         cap drop _merge;

.         drop if product==.;
(228 observations deleted)

.         merge hhid using `thhcons';
variable hhid does not uniquely identify observations in the master data

.         tab _merge;

     _merge |      Freq.     Percent        Cum.
------------+-----------------------------------
          2 |        228        0.41        0.41
          3 |     54,941       99.59      100.00
------------+-----------------------------------
      Total |     55,169      100.00

.         for var valued_tot quantityd_tot : replace X=0 if _merge==2;

->  replace valued_tot=0 if _merge==2
(228 real changes made)

->  replace quantityd_tot=0 if _merge==2
(228 real changes made)

.                 /*
>         for var valued_ac quantityd_ac valued_re quantityd_re valued_dd quantityd_dd 
>                 valued_tot quantityd_tot : replace X=0 if _merge==2;
>                                 */
> 
>         replace hhsize  =cc_hhs     if _merge==2;
(228 real changes made)

.         replace strata  =cc_reg     if _merge==2;
(228 real changes made)

.         replace hhweight=cc_hhw     if _merge==2;
(228 real changes made)

.         replace rural   =cc_rur     if _merge==2;
(228 real changes made)

.         replace news    =cc_news        if _merge==2;
(228 real changes made)

.         replace survquar=cc_qua     if _merge==2;
(228 real changes made)

.         replace reg_tpi =cc_reg_tpi     if _merge==2;
(228 real changes made)

.         drop _merge cc_* ;

.                 fillin hhid product;

.         replace valued_tot=0 if _fillin;
(118143 real changes made)

.                 for var quantityd_tot 
>                 strata rural hhweight hhsize survquar survmon news reg_tpi cons_hh_nom :
>                 egen tmp=mean(X), by(hhid) \
>                 replace X=tmp if _fillin \
>                 drop tmp;

->  egen tmp=mean(quantityd_tot), by(hhid)

->  replace quantityd_tot=tmp if _fillin
(118143 real changes made)

->  drop tmp

->  egen tmp=mean(strata), by(hhid)

->  replace strata=tmp if _fillin
(118143 real changes made)

->  drop tmp

->  egen tmp=mean(rural), by(hhid)

->  replace rural=tmp if _fillin
(118143 real changes made)

->  drop tmp

->  egen tmp=mean(hhweight), by(hhid)

->  replace hhweight=tmp if _fillin
(118143 real changes made)

->  drop tmp

->  egen tmp=mean(hhsize), by(hhid)

->  replace hhsize=tmp if _fillin
(118143 real changes made)

->  drop tmp

->  egen tmp=mean(survquar), by(hhid)

->  replace survquar=tmp if _fillin
(118143 real changes made)

->  drop tmp

->  egen tmp=mean(survmon), by(hhid)
(3648 missing values generated)

->  replace survmon=tmp if _fillin
(114723 real changes made)

->  drop tmp

->  egen tmp=mean(news), by(hhid)

->  replace news=tmp if _fillin
(118143 real changes made)

->  drop tmp

->  egen tmp=mean(reg_tpi), by(hhid)

->  replace reg_tpi=tmp if _fillin
(118143 real changes made)

->  drop tmp

->  egen tmp=mean(cons_hh_nom), by(hhid)

->  replace cons_hh_nom=tmp if _fillin
(118143 real changes made)

->  drop tmp

.                                 /*
>         for var valued_ac quantityd_ac valued_re quantityd_re valued_dd quantityd_dd 
>                 quantityd_tot 
>                 strata rural hhweight hhsize survquar survmon news reg_tpi cons_hh_nom :
>                 egen tmp=mean(X), by(hhid) \
>                 replace X=tmp if _fillin \
>                 drop tmp;
>                                 */
> 
> **************************************************************************;
. * Now calculate the shares, and then the mean shares in each strata, 
> * using hhweight*hhsize weighting. 
> * Note that we are not doing quantity weighting now for the shares.
> **************************************************************************;
.         gen share = valued_tot/cons_hh_nom ;

.         gen popwt = hhsize*hhweight;

.         lab var share "HH share in total consumption";

.         lab var popwt "Population weight: hhsize*hhweight";

. **************************************************************************;
. * Select the bottom 50% (weighted) of the distribution of nominal per 
> * capita consumption.
> **************************************************************************;
.         gen cpc=cons_hh_nom/hhsize;

.         sum cpc [aw=hhweight] , detail;

                             cpc
-------------------------------------------------------------
      Percentiles      Smallest
 1%     2.658413       .5010331
 5%     5.590068       .5010331
10%     7.236145       .5010331       Obs              173312
25%     11.17509       .5010331       Sum of Wgt.  73784715.9

50%     18.36883                      Mean           28.23469
                        Largest       Std. Dev.      51.29804
75%     30.42361       4744.847
90%     50.45245       4744.847       Variance       2631.489
95%     72.26707       4744.847       Skewness       26.62856
99%     194.8307       4744.847       Kurtosis       1825.883

.         global medcpc=r(p$tpi_bottom);

. * MAH ;
.  sum;

    Variable |       Obs        Mean    Std. Dev.       Min        Max
-------------+--------------------------------------------------------
        hhid |    173312    543185.7      312336       1005    1060074
     product |    162480    11472.67    259.2723      11112      11782
  valued_tot |    173312    2.273924    8.652889          0   813.9857
quantityd_~t |    173312    .4043971    .5394078          0   20.57143
     survmon |    169664    6.471049    3.388339          1         12
-------------+--------------------------------------------------------
    survquar |    173312    2.502216    1.104243          1          4
    hhweight |    173312    425.7335     395.171   39.58433   8495.651
      hhsize |    173312    4.724612    2.511493          1         34
       rural |    173312    .5178176    .4996839          0          1
        news |    173312    2.050591    .7957093          1          3
-------------+--------------------------------------------------------
     reg_tpi |    173312    3.583364    1.793867          1          6
      strata |    173312    5.886263    3.179434          1         11
    spdomain |     54941    6.443512    3.775281          1         13
 cons_hh_nom |    173312    138.6143    226.7714   1.079779   5191.784
     _fillin |    173312    .6816781    .4658265          0          1
-------------+--------------------------------------------------------
       share |    173312    .0231559    .0721691          0   .9236148
       popwt |    173312    1988.293    2359.453   54.63167   93452.16
         cpc |    173312    35.29387    79.26116   .5010331   4744.847

.  codebook hhid;

-------------------------------------------------------------------------------------------
hhid                                                                           Household ID
-------------------------------------------------------------------------------------------

                  type:  numeric (float)

                 range:  [1005,1060074]               units:  1
         unique values:  10832                    missing .:  0/173312

                  mean:    543186
              std. dev:    312336

           percentiles:        10%       25%       50%       75%       90%
                            104017    269041    556008    818022    970058

.         keep if cpc<=$medcpc;
(97872 observations deleted)

. sum;

    Variable |       Obs        Mean    Std. Dev.       Min        Max
-------------+--------------------------------------------------------
        hhid |     75440      475534    268925.3       1055    1060028
     product |     70725    11472.67    259.2733      11112      11782
  valued_tot |     75440    1.624192    5.493951          0        153
quantityd_~t |     75440    .4071343    .5250686          0      14.28
     survmon |     73264    6.458397    3.352336          1         12
-------------+--------------------------------------------------------
    survquar |     75440    2.478473    1.103224          1          4
    hhweight |     75440    489.0435    474.3927   39.58433   8495.651
      hhsize |     75440    5.369247    2.404595          1         23
       rural |     75440    .6562036    .4749773          0          1
        news |     75440    1.897561    .7450874          1          3
-------------+--------------------------------------------------------
     reg_tpi |     75440    3.138918    1.606863          1          6
      strata |     75440    5.106469    2.649436          1         11
    spdomain |     22091    5.494636    2.953358          1         13
 cons_hh_nom |     75440      60.024    34.93861   1.079779   352.3406
     _fillin |     75440    .7053685      .45588          0          1
-------------+--------------------------------------------------------
       share |     75440    .0263214    .0761545          0   .8745416
       popwt |     75440    2580.966    2978.786   79.16866   93452.16
         cpc |     75440    11.35681     4.17633   .5010331   18.36883

.                 collapse (mean) share (median) medshare=share [aw=popwt] , 
>                         by(reg_tpi product);

.                 egen sumsh=sum(share) , by(reg_tpi);

.                 replace share=share/sumsh;
(90 real changes made)

.                 drop sumsh;

.                 egen sumsh=sum(medshare) , by(reg_tpi);

.                 replace medshare=medshare/sumsh;
(21 real changes made)

.                 drop sumsh;

.                 lab var share "Reg 6: Mean HH share of total consumption";

.                 lab var medshare "Reg 6: Median HH share of total consumption";

.                 sort reg_tpi product;

.                 save "$path/work/tpi_reg_tpi_share.dta", replace;
file C:\Users\Templeton\Desktop\GAPP\GAPP-UGANDA-HARUNA\ww-ug\10_MZ/work/tpi_reg_tpi_share.
> dta saved

.                 tempfile tempwt6;

.                 save `tempwt6', replace;
(note: file C:\Users\TEMPLE~1\AppData\Local\Temp\ST_0j00000g.tmp not found)
file C:\Users\TEMPLE~1\AppData\Local\Temp\ST_0j00000g.tmp saved

. use `uvq', clear;

.         sort reg_tpi product;

. save , replace;
file C:\Users\TEMPLE~1\AppData\Local\Temp\ST_0j00000c.tmp saved

. use `tempwt6';

.         merge reg_tpi product using `uvq';
variables reg_tpi product do not uniquely identify observations in
    C:\Users\TEMPLE~1\AppData\Local\Temp\ST_0j00000c.tmp
(label news_ru_ur already defined)

.         tab _merge;

     _merge |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |          6        1.64        1.64
          3 |        359       98.36      100.00
------------+-----------------------------------
      Total |        365      100.00

.         gen tpi1     =ppkg     *share;
(6 missing values generated)

.         gen tpi1_trim=ppkg_trim*share;
(6 missing values generated)

. sum;

    Variable |       Obs        Mean    Std. Dev.       Min        Max
-------------+--------------------------------------------------------
     product |       359    11473.58    259.4192      11112      11782
     reg_tpi |       365     3.49589      1.7107          1          6
       share |       365    .0657481    .0693028          0   .3333441
    medshare |       365    .0657534    .1629856          0          1
    survquar |       359    2.495822    1.118338          1          4
-------------+--------------------------------------------------------
        news |       359    1.997214    .8170618          1          3
  valued_tot |       359    269.1271    439.3988          1   4487.894
quantityd_~t |       359    19.31126     33.7992   .0422857   308.4034
        ppkg |       359    27.70478    24.84912   2.139673    129.138
   ppkg_trim |       359     26.5823    24.34726   1.960121    129.138
-------------+--------------------------------------------------------
      _merge |       365    2.967123    .2546571          1          3
        tpi1 |       359    1.613307    1.661259    .006627   7.731228
   tpi1_trim |       359    1.574112    1.639123    .006627   7.920565

. keep if survquar!=.;
(6 observations deleted)

. sum;

    Variable |       Obs        Mean    Std. Dev.       Min        Max
-------------+--------------------------------------------------------
     product |       359    11473.58    259.4192      11112      11782
     reg_tpi |       359    3.495822    1.710748          1          6
       share |       359    .0668469    .0693521   .0019545   .3333441
    medshare |       359    .0668524    .1641214          0          1
    survquar |       359    2.495822    1.118338          1          4
-------------+--------------------------------------------------------
        news |       359    1.997214    .8170618          1          3
  valued_tot |       359    269.1271    439.3988          1   4487.894
quantityd_~t |       359    19.31126     33.7992   .0422857   308.4034
        ppkg |       359    27.70478    24.84912   2.139673    129.138
   ppkg_trim |       359     26.5823    24.34726   1.960121    129.138
-------------+--------------------------------------------------------
      _merge |       359           3           0          3          3
        tpi1 |       359    1.613307    1.661259    .006627   7.731228
   tpi1_trim |       359    1.574112    1.639123    .006627   7.920565

. list in  1/3;

     +------------------------------------------------------------------------------------+
  1. |   product    |        reg_tpi    |      share    |   medshare    |     survquar    |
     |     11112    |   North  Rural    |   .0410937    |          0    |   Sep-Nov 08    |
     |------------------------------------------------------------------------------------|
     |                                   news | valued~t | quanti~t |     ppkg | ppkg_t~m |
     | North:   Niassa, Cabo Delgado, Nampula | 195.8465 | 7.243705 | 27.03679 | 27.08414 |
     |------------------------------------------------------------------------------------|
     |          _merge          |              tpi1          |          tpi1_t~m          |
     |               3          |          1.111041          |          1.112987          |
     +------------------------------------------------------------------------------------+

     +------------------------------------------------------------------------------------+
  2. |   product    |        reg_tpi    |      share    |   medshare    |     survquar    |
     |     11121    |   North  Rural    |   .0143089    |          0    |   Sep-Nov 08    |
     |------------------------------------------------------------------------------------|
     |                                   news | valued~t | quanti~t |     ppkg | ppkg_t~m |
     | North:   Niassa, Cabo Delgado, Nampula | 101.6149 | 11.45841 | 8.868153 | 8.640005 |
     |------------------------------------------------------------------------------------|
     |          _merge          |              tpi1          |          tpi1_t~m          |
     |               3          |          .1268932          |          .1236287          |
     +------------------------------------------------------------------------------------+

     +------------------------------------------------------------------------------------+
  3. |   product    |        reg_tpi    |      share    |   medshare    |     survquar    |
     |     11141    |   North  Rural    |   .2442973    |   .2765338    |   Sep-Nov 08    |
     |------------------------------------------------------------------------------------|
     |                                   news | valued~t | quanti~t |     ppkg | ppkg_t~m |
     | North:   Niassa, Cabo Delgado, Nampula | 1012.039 | 69.53943 | 14.55345 | 13.87925 |
     |------------------------------------------------------------------------------------|
     |          _merge          |              tpi1          |          tpi1_t~m          |
     |               3          |          3.555369          |          3.390664          |
     +------------------------------------------------------------------------------------+

. list in -3/-1;

     +--------------------------------------------------------------------------+
357. |  product   |       reg_tpi   |    share   |  medshare   |     survquar   |
     |    11782   |  South  Urban   |  .063013   |         0   |   Dec-Feb 09   |
     |--------------------------------------------------------------------------|
     |                                    news | valued~t | quanti~t |     ppkg |
     | South:   Gaza, Inha, Map Prov, Map City | 67.75916 | 11.06728 | 6.122477 |
     |--------------------------------------------------------------------------|
     |     ppkg_t~m     |     _merge     |         tpi1     |     tpi1_t~m      |
     |      6.10418     |          3     |     .3857954     |     .3846424      |
     +--------------------------------------------------------------------------+

     +--------------------------------------------------------------------------+
358. |  product   |       reg_tpi   |    share   |  medshare   |     survquar   |
     |    11782   |  South  Urban   |  .063013   |         0   |   Mar-May 09   |
     |--------------------------------------------------------------------------|
     |                                    news | valued~t | quanti~t |     ppkg |
     | South:   Gaza, Inha, Map Prov, Map City | 128.0858 | 20.08877 | 6.375993 |
     |--------------------------------------------------------------------------|
     |     ppkg_t~m     |     _merge     |         tpi1     |     tpi1_t~m      |
     |     4.543394     |          3     |     .4017701     |     .2862927      |
     +--------------------------------------------------------------------------+

     +--------------------------------------------------------------------------+
359. |  product   |       reg_tpi   |    share   |  medshare   |     survquar   |
     |    11782   |  South  Urban   |  .063013   |         0   |   Jun-Aug 09   |
     |--------------------------------------------------------------------------|
     |                                    news | valued~t | quanti~t |     ppkg |
     | South:   Gaza, Inha, Map Prov, Map City | 237.2222 | 32.55453 | 7.286919 |
     |--------------------------------------------------------------------------|
     |     ppkg_t~m     |     _merge     |         tpi1     |     tpi1_t~m      |
     |     6.155719     |          3     |     .4591703     |       .38789      |
     +--------------------------------------------------------------------------+

.         **************************************************************************;
. * Find TPI level and indexes for non-trimmed and trimmed prices
> **************************************************************************;
. * Not trimmed ;
.         collapse (sum) tpi1 tpi1_trim  , by(reg_tpi survquar);

.                 for num 1/$n_tpi :
>                         sum tpi1 if reg_tpi==X & survquar==2 , meanonly \
>                         sum tpi1 if reg_tpi==X & survquar==4 , meanonly \
>                         global baseX=r(mean);

->  sum tpi1 if reg_tpi==1 & survquar==2 , meanonly

->  sum tpi1 if reg_tpi==1 & survquar==4 , meanonly

->  global base1=r(mean)

->  sum tpi1 if reg_tpi==2 & survquar==2 , meanonly

->  sum tpi1 if reg_tpi==2 & survquar==4 , meanonly

->  global base2=r(mean)

->  sum tpi1 if reg_tpi==3 & survquar==2 , meanonly

->  sum tpi1 if reg_tpi==3 & survquar==4 , meanonly

->  global base3=r(mean)

->  sum tpi1 if reg_tpi==4 & survquar==2 , meanonly

->  sum tpi1 if reg_tpi==4 & survquar==4 , meanonly

->  global base4=r(mean)

->  sum tpi1 if reg_tpi==5 & survquar==2 , meanonly

->  sum tpi1 if reg_tpi==5 & survquar==4 , meanonly

->  global base5=r(mean)

->  sum tpi1 if reg_tpi==6 & survquar==2 , meanonly

->  sum tpi1 if reg_tpi==6 & survquar==4 , meanonly

->  global base6=r(mean)

.                 lab var tpi1 "Six regions: Temporal price index before normalization";

.                 gen     tpi=tpi1/$base1 if reg_tpi==1;
(20 missing values generated)

.                 replace tpi=tpi1/$base2 if reg_tpi==2;
(4 real changes made)

.                 replace tpi=tpi1/$base3 if reg_tpi==3;
(4 real changes made)

.                 replace tpi=tpi1/$base4 if reg_tpi==4;
(4 real changes made)

.                 replace tpi=tpi1/$base5 if reg_tpi==5;
(4 real changes made)

.                 replace tpi=tpi1/$base6 if reg_tpi==6;
(4 real changes made)

.                 lab var tpi "Six regions: Temporal price index (Q4=1)";

. * Trimmed ;
.                 for num 1/$n_tpi :
>                         sum tpi1_trim if reg_tpi==X & survquar==2 , meanonly \
>                         sum tpi1_trim if reg_tpi==X & survquar==4 , meanonly \
>                         global baseX=r(mean);

->  sum tpi1_trim if reg_tpi==1 & survquar==2 , meanonly

->  sum tpi1_trim if reg_tpi==1 & survquar==4 , meanonly

->  global base1=r(mean)

->  sum tpi1_trim if reg_tpi==2 & survquar==2 , meanonly

->  sum tpi1_trim if reg_tpi==2 & survquar==4 , meanonly

->  global base2=r(mean)

->  sum tpi1_trim if reg_tpi==3 & survquar==2 , meanonly

->  sum tpi1_trim if reg_tpi==3 & survquar==4 , meanonly

->  global base3=r(mean)

->  sum tpi1_trim if reg_tpi==4 & survquar==2 , meanonly

->  sum tpi1_trim if reg_tpi==4 & survquar==4 , meanonly

->  global base4=r(mean)

->  sum tpi1_trim if reg_tpi==5 & survquar==2 , meanonly

->  sum tpi1_trim if reg_tpi==5 & survquar==4 , meanonly

->  global base5=r(mean)

->  sum tpi1_trim if reg_tpi==6 & survquar==2 , meanonly

->  sum tpi1_trim if reg_tpi==6 & survquar==4 , meanonly

->  global base6=r(mean)

.                 lab var tpi1_trim "Six regions: TRIMMED Temporal price index before norma
> lization";

.                 gen     tpi_trim=tpi1_trim/$base1 if reg_tpi==1;
(20 missing values generated)

.                 replace tpi_trim=tpi1_trim/$base2 if reg_tpi==2;
(4 real changes made)

.                 replace tpi_trim=tpi1_trim/$base3 if reg_tpi==3;
(4 real changes made)

.                 replace tpi_trim=tpi1_trim/$base4 if reg_tpi==4;
(4 real changes made)

.                 replace tpi_trim=tpi1_trim/$base5 if reg_tpi==5;
(4 real changes made)

.                 replace tpi_trim=tpi1_trim/$base6 if reg_tpi==6;
(4 real changes made)

.                 lab var tpi_trim "Six regions: TRIMMED Temporal price index (Q4=1)";

.                 sort reg_tpi survquar;

.             drop if reg_tpi<1 | reg_tpi>$n_tpi;
(0 observations deleted)

. gen tpi_diff = tpi - tpi_trim;

. lab var tpi_diff "Six regions: TPI difference btw trimmed/untrimmed";

. twoway (connected tpi_trim survquar),yline(1) by(, title("TPI: Trimmed"))
> by(reg_tpi) sav("$path/work/reg_tpi-tpi_trim", replace);
(file C:\Users\Templeton\Desktop\GAPP\GAPP-UGANDA-HARUNA\ww-ug\10_MZ/work/reg_tpi-tpi_trim.
> gph saved)

. graph export "$path/work/reg_tpi-tpi_trim.tif", replace;
(file C:\Users\Templeton\Desktop\GAPP\GAPP-UGANDA-HARUNA\ww-ug\10_MZ/work/reg_tpi-tpi_trim.
> tif written in TIFF format)

. list reg_tpi survquar tpi tpi_trim tpi_diff;

     +-------------------------------------------------------------+
     |      reg_tpi     survquar        tpi   tpi_trim    tpi_diff |
     |-------------------------------------------------------------|
  1. | North  Rural   Sep-Nov 08    .912612   .9953414   -.0827293 |
  2. | North  Rural   Dec-Feb 09   1.163104   1.107258    .0558459 |
  3. | North  Rural   Mar-May 09   .9071305   .9402306   -.0331001 |
  4. | North  Rural   Jun-Aug 09          1          1           0 |
  5. | North  Urban   Sep-Nov 08   1.057766   1.075176   -.0174092 |
     |-------------------------------------------------------------|
  6. | North  Urban   Dec-Feb 09   1.054866   1.058931   -.0040652 |
  7. | North  Urban   Mar-May 09   .8761702    .911971   -.0358008 |
  8. | North  Urban   Jun-Aug 09          1          1           0 |
  9. | Center Rural   Sep-Nov 08   1.123977   1.066652    .0573246 |
 10. | Center Rural   Dec-Feb 09   1.217065   1.144117    .0729481 |
     |-------------------------------------------------------------|
 11. | Center Rural   Mar-May 09   1.041077   .9875785    .0534984 |
 12. | Center Rural   Jun-Aug 09          1          1           0 |
 13. | Center Urban   Sep-Nov 08   .9757795   .9375213    .0382583 |
 14. | Center Urban   Dec-Feb 09   1.226958   1.095394    .1315644 |
 15. | Center Urban   Mar-May 09   1.028089   .9705712    .0575176 |
     |-------------------------------------------------------------|
 16. | Center Urban   Jun-Aug 09          1          1           0 |
 17. | South  Rural   Sep-Nov 08   1.053686   1.081639   -.0279536 |
 18. | South  Rural   Dec-Feb 09   1.152788   1.137095    .0156924 |
 19. | South  Rural   Mar-May 09   .9062926   .9681588   -.0618663 |
 20. | South  Rural   Jun-Aug 09          1          1           0 |
     |-------------------------------------------------------------|
 21. | South  Urban   Sep-Nov 08    .920225   .9880164   -.0677913 |
 22. | South  Urban   Dec-Feb 09    1.01327   1.017712   -.0044428 |
 23. | South  Urban   Mar-May 09    1.01154   1.009574    .0019664 |
 24. | South  Urban   Jun-Aug 09          1          1           0 |
     +-------------------------------------------------------------+

.                 sort reg_tpi survquar;

. keep reg_tpi survquar tpi_trim;

. save "$path/work/temp_index_reg_tpi.dta", replace;
file C:\Users\Templeton\Desktop\GAPP\GAPP-UGANDA-HARUNA\ww-ug\10_MZ/work/temp_index_reg_tpi
> .dta saved

.                        ******************************************************************
> ********
> * 090_temp_index.do     (end)
> **************************************************************************;
. cap log close;
