----------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /home/bjvca/data/data/GAP/Haruna/UNPS_2005_06//rep/070_calpp.log
  log type:  text
 opened on:  10 Mar 2014, 14:47:05

. clear

. set more off

. #delimit ;
delimiter now ;
. *global fert_rate "fert_rate";
. ***********************************************************************
> * 070_calpp.do          (start)
> *
> * Purpose: Determine calories required for each person per domain per day.
> ***********************************************************************;
. /*
> This file uses:
>         work/indata.dta
>         work/hhdata.dta
> 
> This file creates:
>         work/calpp.dta
> */
> 
> *-------------------------------------------------------------------------*
> * Include fertility rates from csv-file
> *-------------------------------------------------------------------------*;
. clear;

. insheet sex rural age fert_rate using "$path/in/fert_rate_Uganda.csv";
(4 vars, 96 obs)

. ***************************************** check for Ugandan fertility rates ****************
> *********************
> ********************************************************************************************
> *****************;
. sort sex rural age;

. tempfile fert_rate;

. save `fert_rate';
file /tmp/St02564.000001 saved

. list;

     +------------------------------+
     | sex   rural   age   fert_r~e |
     |------------------------------|
  1. |   2       0    12       .008 |
  2. |   2       0    13       .008 |
  3. |   2       0    14       .008 |
  4. |   2       0    15       .134 |
  5. |   2       0    16       .134 |
     |------------------------------|
  6. |   2       0    17       .134 |
  7. |   2       0    18       .134 |
  8. |   2       0    19       .134 |
  9. |   2       0    20       .313 |
 10. |   2       0    21       .313 |
     |------------------------------|
 11. |   2       0    22       .313 |
 12. |   2       0    23       .313 |
 13. |   2       0    24       .313 |
 14. |   2       0    25       .291 |
 15. |   2       0    26       .291 |
     |------------------------------|
 16. |   2       0    27       .291 |
 17. |   2       0    28       .291 |
 18. |   2       0    29       .291 |
 19. |   2       0    30       .232 |
 20. |   2       0    31       .232 |
     |------------------------------|
 21. |   2       0    32       .232 |
 22. |   2       0    33       .232 |
 23. |   2       0    34       .232 |
 24. |   2       0    35       .172 |
 25. |   2       0    36       .172 |
     |------------------------------|
 26. |   2       0    37       .172 |
 27. |   2       0    38       .172 |
 28. |   2       0    39       .172 |
 29. |   2       0    40       .074 |
 30. |   2       0    41       .074 |
     |------------------------------|
 31. |   2       0    42       .074 |
 32. |   2       0    43       .074 |
 33. |   2       0    44       .074 |
 34. |   2       0    45       .023 |
 35. |   2       0    46       .023 |
     |------------------------------|
 36. |   2       0    47       .023 |
 37. |   2       0    48       .023 |
 38. |   2       0    49       .023 |
 39. |   2       0    50       .006 |
 40. |   2       0    51       .006 |
     |------------------------------|
 41. |   2       0    52       .006 |
 42. |   2       0    53       .006 |
 43. |   2       0    54       .006 |
 44. |   2       0    55       .006 |
 45. |   2       0    56       .006 |
     |------------------------------|
 46. |   2       0    57       .006 |
 47. |   2       0    58       .006 |
 48. |   2       0    59       .006 |
 49. |   2       1    12       .008 |
 50. |   2       1    13       .008 |
     |------------------------------|
 51. |   2       1    14       .008 |
 52. |   2       1    15       .134 |
 53. |   2       1    16       .134 |
 54. |   2       1    17       .134 |
 55. |   2       1    18       .134 |
     |------------------------------|
 56. |   2       1    19       .134 |
 57. |   2       1    20       .313 |
 58. |   2       1    21       .313 |
 59. |   2       1    22       .313 |
 60. |   2       1    23       .313 |
     |------------------------------|
 61. |   2       1    24       .313 |
 62. |   2       1    25       .291 |
 63. |   2       1    26       .291 |
 64. |   2       1    27       .291 |
 65. |   2       1    28       .291 |
     |------------------------------|
 66. |   2       1    29       .291 |
 67. |   2       1    30       .232 |
 68. |   2       1    31       .232 |
 69. |   2       1    32       .232 |
 70. |   2       1    33       .232 |
     |------------------------------|
 71. |   2       1    34       .232 |
 72. |   2       1    35       .172 |
 73. |   2       1    36       .172 |
 74. |   2       1    37       .172 |
 75. |   2       1    38       .172 |
     |------------------------------|
 76. |   2       1    39       .172 |
 77. |   2       1    40       .074 |
 78. |   2       1    41       .074 |
 79. |   2       1    42       .074 |
 80. |   2       1    43       .074 |
     |------------------------------|
 81. |   2       1    44       .074 |
 82. |   2       1    45       .023 |
 83. |   2       1    46       .023 |
 84. |   2       1    47       .023 |
 85. |   2       1    48       .023 |
     |------------------------------|
 86. |   2       1    49       .023 |
 87. |   2       1    50       .006 |
 88. |   2       1    51       .006 |
 89. |   2       1    52       .006 |
 90. |   2       1    53       .006 |
     |------------------------------|
 91. |   2       1    54       .006 |
 92. |   2       1    55       .006 |
 93. |   2       1    56       .006 |
 94. |   2       1    57       .006 |
 95. |   2       1    58       .006 |
     |------------------------------|
 96. |   2       1    59       .006 |
     +------------------------------+

. *-------------------------------------------------------------------------*
> * Now do the calorie needs for individuals
> *-------------------------------------------------------------------------*;
. use "$path/work/indata.dta";

. * CA bootstrap modification;
. sort hhid;

. merge hhid using "$path/work/hhdata.dta";
variable hhid does not uniquely identify observations in the master data

. tab _m;

     _merge |      Freq.     Percent        Cum.
------------+-----------------------------------
          3 |     16,759      100.00      100.00
------------+-----------------------------------
      Total |     16,759      100.00

.  drop _m;

. sum;

    Variable |       Obs        Mean    Std. Dev.       Min        Max
-------------+--------------------------------------------------------
       indid |     16759    1.15e+12    1.25e+12   2.03e+11   4.61e+12
    motherhh |      8206           0           0          0          0
        hhid |     16759    2.47e+09    1.15e+09   1.01e+09   4.19e+09
         sex |     16759    1.511248    .4998884          1          2
         age |     16759    19.75619    17.18438          0        102
-------------+--------------------------------------------------------
          hh |         0
         psu |     16731    2.45e+07    1.14e+07   1.01e+07   4.15e+07
      region |     16731    2.379953    1.140978          1          4
    h1aq1_05 |     16731    244.8445    114.4735        101        415
       h1aq1 |     16731    246.7354    115.0025        101        419
-------------+--------------------------------------------------------
       urban |     16731    .2545574    .4356252          0          1
tracking_s~e |     16731    .2037535    .4027998          0          1
    inidpcmp |     16731           2           0          2          2
      h1bq2a |     16731    16.78083    6.442273          3         31
      h1bq2b |     16731    7.682027    1.614348          5         11
-------------+--------------------------------------------------------
      h1bq2c |     16731    2005.375    .4840427       2005       2006
interview_~t |     16731    1.000418    .0204508          1          2
        wave |     16731           0           0          0          0
    hhweight |     16731    1683.355    737.5353   140.8407   5553.862
     stratum |     16731    3.784651    1.590639          1          6
-------------+--------------------------------------------------------
    survquar |     16731    2.461419    1.413745          1          5
     survmon |     16731    6.304465    4.259338          1         14
      strata |     16731    4.505349    2.406286          1          8
       rural |     16731    .7454426    .4356252          0          1
     reg_tpi |     16731    2.379953    1.140978          1          4
-------------+--------------------------------------------------------
    spdomain |     16731      3.2539    1.326619          1          5
        news |     16731    2.379953    1.140978          1          4
        bswt |     16731           1           0          1          1
      hhsize |     16759    7.166716    3.472568          1         29

. * Include fertility rates;
. sort sex rural age;

. merge sex rural age using `fert_rate';
variables sex rural age do not uniquely identify observations in the master data

. sum;

    Variable |       Obs        Mean    Std. Dev.       Min        Max
-------------+--------------------------------------------------------
       indid |     16759    1.15e+12    1.25e+12   2.03e+11   4.61e+12
    motherhh |      8206           0           0          0          0
        hhid |     16759    2.47e+09    1.15e+09   1.01e+09   4.19e+09
         sex |     16759    1.511248    .4998884          1          2
         age |     16759    19.75619    17.18438          0        102
-------------+--------------------------------------------------------
          hh |         0
         psu |     16731    2.45e+07    1.14e+07   1.01e+07   4.15e+07
      region |     16731    2.379953    1.140978          1          4
    h1aq1_05 |     16731    244.8445    114.4735        101        415
       h1aq1 |     16731    246.7354    115.0025        101        419
-------------+--------------------------------------------------------
       urban |     16731    .2545574    .4356252          0          1
tracking_s~e |     16731    .2037535    .4027998          0          1
    inidpcmp |     16731           2           0          2          2
      h1bq2a |     16731    16.78083    6.442273          3         31
      h1bq2b |     16731    7.682027    1.614348          5         11
-------------+--------------------------------------------------------
      h1bq2c |     16731    2005.375    .4840427       2005       2006
interview_~t |     16731    1.000418    .0204508          1          2
        wave |     16731           0           0          0          0
    hhweight |     16731    1683.355    737.5353   140.8407   5553.862
     stratum |     16731    3.784651    1.590639          1          6
-------------+--------------------------------------------------------
    survquar |     16731    2.461419    1.413745          1          5
     survmon |     16731    6.304465    4.259338          1         14
      strata |     16731    4.505349    2.406286          1          8
       rural |     16731    .7454426    .4356252          0          1
     reg_tpi |     16731    2.379953    1.140978          1          4
-------------+--------------------------------------------------------
    spdomain |     16731      3.2539    1.326619          1          5
        news |     16731    2.379953    1.140978          1          4
        bswt |     16731           1           0          1          1
      hhsize |     16759    7.166716    3.472568          1         29
   fert_rate |      4895    .1603115    .1141129       .006       .313
-------------+--------------------------------------------------------
      _merge |     16759    1.584164    .9094666          1          3

. * Do calorie calculations ;
.     gen num=1;

.     gen cal = .;
(16759 missing values generated)

. * Same assumptions about sex/age specific calories need in IAF 1997, IAF 2003 and IOF 2009;
. * Children (no difference between boys and girls)   ;
.      replace cal =  820 if age < 1;
(636 real changes made)

. * Add 500 cal per day for mothers in first six months of breast feeding
> * We assume that 60% of children under 1 are under six months old
> * And that all of them breast feed
> * We add these mother requirements of 300 on average to each child under 1 whose mother is a
> live;
.     replace cal = 1120 if age <  1 & motherhh==1;
(0 real changes made)

.     replace cal = 1150 if age >= 1 & age <2;
(571 real changes made)

.     replace cal = 1350 if age >= 2 & age <3;
(637 real changes made)

.     replace cal = 1550 if age >= 3 & age <5;
(1080 real changes made)

. * Males ;
.     replace cal = 1850 if age >=  5 & age <7  & sex==1;
(582 real changes made)

.     replace cal = 2100 if age >=  7 & age <10 & sex==1;
(773 real changes made)

.     replace cal = 2200 if age >= 10 & age <12 & sex==1;
(486 real changes made)

.     replace cal = 2400 if age >= 12 & age <14 & sex==1;
(532 real changes made)

.     replace cal = 2650 if age >= 14 & age <16 & sex==1;
(471 real changes made)

.     replace cal = 2850 if age >= 16 & age <18 & sex==1;
(384 real changes made)

.     replace cal = 3000 if age >= 18 & age <30 & sex==1;
(1590 real changes made)

.     replace cal = 2900 if age >= 30 & age <60 & sex==1;
(1606 real changes made)

.     replace cal = 2450 if age>=60 & age~=. & sex==1;
(312 real changes made)

. * Girls 5-12 years (probability of pregnancy assumed = 0) ;
.     replace cal = 1750 if age >=  5 & age < 7 & sex==2;
(563 real changes made)

.     replace cal = 1800 if age >=  7 & age <10 & sex==2;
(755 real changes made)

.     replace cal = 1950 if age >= 10 & age <12 & sex==2;
(540 real changes made)

. * Women with a correction for pregnancy. We add 285 calories per for the final trimester.
> * To do this we find the probability that rural and urban women are pregnant from
> * live births data in the 1997 census over the past 12 months (no correction for still birth
> s).
> * 3/4*probability of birth gives probability of preganancy. Probability of final trimester i
> s one
> * third of that of that or 1/4 of the probability of birth
> 
> * Women urban;
.     replace cal = 2100 + (fert_rate*285)/4 if age >= 12 & age <14 & sex==2 & rural==0;
(134 real changes made)

.     replace cal = 2150 + (fert_rate*285)/4 if age >= 14 & age <18 & sex==2 & rural==0;
(222 real changes made)

.     replace cal = 2100 + (fert_rate*285)/4 if age >= 18 & age <30 & sex==2 & rural==0;
(623 real changes made)

.     replace cal = 2150 + (fert_rate*285)/4 if age >= 30 & age <60 & sex==2 & rural==0;
(422 real changes made)

. * Women rural;
.     replace cal = 2100 + (fert_rate*285)/4 if age >= 12 & age <14 & sex==2 & rural==1;
(374 real changes made)

.     replace cal = 2150 + (fert_rate*285)/4 if age >= 14 & age <18 & sex==2 & rural==1;
(630 real changes made)

.     replace cal = 2100 + (fert_rate*285)/4 if age >= 18 & age <30 & sex==2 & rural==1;
(1242 real changes made)

.     replace cal = 2150 + (fert_rate*285)/4 if age >= 30 & age <60 & sex==2 & rural==1;
(1248 real changes made)

. * Women 60+ are not pregnant ;
.     replace cal = 1950 if age>=60 & age~=. & sex==2;
(339 real changes made)

.     count if cal ==.;
    7

.     *Fill in these two observations for IAF 2002/03:;
.     * 1) this one is a child;
.     *replace cal = 1500 if cal ==. & age==.;
.     * 2) this one is 21 years old;
.     *replace cal = 2500 if cal ==. & b2==.;
.     collapse (sum) cal num (max) psu hhsize hhweight strata rural spdomain, by (hhid);

.     gen chk=hhsize - num;

.     sum chk;

    Variable |       Obs        Mean    Std. Dev.       Min        Max
-------------+--------------------------------------------------------
         chk |      3123           0           0          0          0

.     drop chk;

.     gen calpp = cal / hhsize;

.     sort spdomain;

. sum;

    Variable |       Obs        Mean    Std. Dev.       Min        Max
-------------+--------------------------------------------------------
        hhid |      3123    2.43e+09    1.16e+09   1.01e+09   4.19e+09
         cal |      3123    11467.27    6718.735       1950   70377.13
         num |      3123    5.366314    3.108797          1         29
         psu |      3119    2.42e+07    1.16e+07   1.01e+07   4.15e+07
      hhsize |      3123    5.366314    3.108797          1         29
-------------+--------------------------------------------------------
    hhweight |      3119    1673.657     752.607   140.8407   5553.862
      strata |      3119    4.414877    2.449958          1          8
       rural |      3119    .7242706    .4469527          0          1
    spdomain |      3119     3.19782    1.362579          1          5
       calpp |      3123    2185.638     303.542       1310       3000

. * MAH ;
.  sum;

    Variable |       Obs        Mean    Std. Dev.       Min        Max
-------------+--------------------------------------------------------
        hhid |      3123    2.43e+09    1.16e+09   1.01e+09   4.19e+09
         cal |      3123    11467.27    6718.735       1950   70377.13
         num |      3123    5.366314    3.108797          1         29
         psu |      3119    2.42e+07    1.16e+07   1.01e+07   4.15e+07
      hhsize |      3123    5.366314    3.108797          1         29
-------------+--------------------------------------------------------
    hhweight |      3119    1673.657     752.607   140.8407   5553.862
      strata |      3119    4.414877    2.449958          1          8
       rural |      3119    .7242706    .4469527          0          1
    spdomain |      3119     3.19782    1.362579          1          5
       calpp |      3123    2185.638     303.542       1310       3000

.  codebook hhid;

----------------------------------------------------------------------------------------------
hhid                                                                              Household ID
----------------------------------------------------------------------------------------------

                  type:  numeric (double)

                 range:  [1.013e+09,4.193e+09]        units:  1
         unique values:  3123                     missing .:  0/3123

                  mean:   2.4e+09
              std. dev:   1.2e+09

           percentiles:        10%       25%       50%       75%       90%
                           1.0e+09   1.1e+09   2.2e+09   3.2e+09   4.1e+09

. collapse (mean) calpp[aw=hhsize*hhweight], by (spdomain);

. sort spdomain;

. save "$path/work/calpp.dta",replace;
file /home/bjvca/data/data/GAP/Haruna/UNPS_2005_06//work/calpp.dta saved

. ***********************************************************************
> * 070_calpp.do          (end)
> ***********************************************************************;
. log close;
      name:  <unnamed>
       log:  /home/bjvca/data/data/GAP/Haruna/UNPS_2005_06//rep/070_calpp.log
  log type:  text
 closed on:  10 Mar 2014, 14:47:06
----------------------------------------------------------------------------------------------
