----------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /home/bjvca/data/data/GAP/Haruna/UNPS_2005_06//rep/170_pref_r_price.log
  log type:  text
 opened on:  10 Mar 2014, 14:48:50

. clear

. set more off

. #delimit ;
delimiter now ;
. **************************************************************************
> * 170_pref_r_price.do           (start)
> *
> * This file conducts revealed preference comparisons so that
> * we can check the quality of the regional baskets.
> * It also exports the price and quantity data for work in GAMS
> * Rather than make up for missing prices with shares, we estimate
> * a missing price in this case
> **************************************************************************;
. *global n_spdom "13";
. *global it_n "5";
. /*
> This file uses:
>         work/quan_flex_it$it_n.dta
>         work/povline_food_flex_it$it_n.dta
>         work/price_unit_flex_it$it_n.dta
>                 
> This file creates:
>         work/pref_r_price.dta
>         work/revpref_price_`i'.dta
>         work/product_flex.inc
>         work/price_unit_flex.inc
>         work/quan_flex.inc
> */
> 
> 
> 
> ***************************************************************************;
. * Export price, codes and quantity data to text
> ***************************************************************************;
. use "$path/work/price_unit_flex_it$it_n.dta";

. gen reg=spdomain ;

. gen crap=1;

.  lab def crap
>          1  ".";

.  lab val crap crap;

. outsheet product crap reg bswt price_uw$it_n using "$path/work/price_unit_flex.inc",  noquot
> e noname replace ;

. collapse (min) spdomain, by(product);

. outsheet product  using "$path/work/product_flex.inc", noname replace;

. use "$path/work/quan_flex_it$it_n.dta", clear;

. gen reg=spdomain;

. gen crap=1;

.  lab def crap
>          1  ".";

.  lab val crap crap;

. format calperg quan$it_n calpp %14.9e;

. outsheet  product crap reg calperg quan$it_n  calpp povline_f_flex90_$it_n using "$path/work
> /quan_flex.inc", noname noquote replace;

. clear;

. **************************************************************************;
. * Revealed preference calculations
> * get the basket for the region we want to test
> **************************************************************************;
. tempfile quanreg;

. tempfile getmiss;

. tempfile codmiss;

. gen crap=0;

. save "$path/work/pref_r_price.dta", replace;
(note: dataset contains 0 observations)
file /home/bjvca/data/data/GAP/Haruna/UNPS_2005_06//work/pref_r_price.dta saved

. forvalues i=1/$n_spdom {                ;
  2.         clear;
  3.         gen crap=0;
  4.         save "$path/work/revpref_price_`i'.dta", replace;
  5.         clear;
  6.                 use "$path/work/quan_flex_it$it_n.dta", clear;
  7.                 keep product spdomain quan$it_n price_uw$it_n val_ir$it_n povline_f_flex9
> 0_$it_n calpp;
  8.         gen share=val_ir$it_n/povline_f_flex90_$it_n;
  9.         rename price_uw$it_n pquanreg;
 10.         rename spdomain spdomainq;
 11.         drop if spdomainq~= `i';
 12.         sort product;
 13.                                 *rescale quantities to hit constant calorie target;
.                 gen ratquan=2150/calpp;
 14.             gen quan_s=quan$it_n*ratquan;
 15.             lab var quan_s "quantities rescaled to hit 2150 calories pp";
 16.         save `quanreg', replace;
 17. **************************************************************************;
. * Now get the prices in other regions so that you can use them 
> * to build  a new poverty line
> **************************************************************************;
.         forvalues j= 1/$n_spdom {               ;
 18.                 use "$path/work/price_unit_flex_it$it_n.dta";
 19.                                 keep product spdomain price_uw$it_n  count bswt;
 20.                         sort product;
 21.                 keep if spdomain==`j';
 22.                 sort product;
 23.                 merge product using `quanreg';
 24.                     *here we have to deal with the fact that not all commodities are cons
> umed in every region;
.                 *so we might have a quantity from region i but no price in region j;
.                 *these will have _merge value=2;
.                 *alternatively the number of observations might be too small;
.                 *deal with these problems by TAKING THE MAX PRICE OBSERVED ELSEWHERE (exclud
> ing Maputo)
>                         
>                 tab _m;
.                 drop if _m==1;
 25.                                 *CA modified to handle the counting of bswt instead of co
> unt
>                   replace price_uw$it_n=. if round(bswt)<5;
.                         gen pricemiss=0;
 26.                   replace spdomain=`j' if _m==2 ;
 27.                   replace pricemiss=1 if _m==2 | round(bswt)<5;
 28.                         lab var pricemiss "identify those items with no price observation
> ";
 29.                   drop _m;
 30.                         sort product;
 31. *browse;
.                *this is the tempfile containing observed quans and prices;
.              save `getmiss', replace;
 32.                         keep if pricemiss==1;
 33.                         if _N>0 {
>                             keep product;
 34.                                             sort product;
 35.                                             *this file contains the price codes that are 
> missing for the region in question;
.                             save `codmiss', replace;
 36. *browse;
.                                   use "$path/work/price_unit_flex_it$it_n.dta", clear;
 37.                         sort product;
 38. *browse;
.                         merge product using `codmiss';
 39.                                                 tab _m;
 40.                         keep if _m==3 ;
 41.                                 *exclude Maputo province and city from other price calcul
> ation;
.                                 drop if spdomain>10;
 42.                         collapse (max) price_uw$it_n, by(product);
 43.                   *this file contains the code and the max price;
.                   save `codmiss', replace;
 44. *browse;
.                         use `getmiss';
 45.                               merge product using `codmiss';
 46. *browse;
.                         tab _m;
 47.                         drop _m;
 48.                         *end if;
.                  };
 49.                                                             else use `getmiss', clear;
 50.                         gen val_q=quan_s*price_uw$it_n;
 51.                                                 collapse (sum) val_q pricemiss (mean) spd
> omainq ratquan, by(spdomain);
 52.                   gen linf_q=val_q/.9;
 53.                   drop val_q;
 54.                         append using "$path/work/revpref_price_`i'.dta";
 55.                         sort spdomain;
 56.                 save "$path/work/revpref_price_`i'.dta", replace;
 57.    *browse;
.         *close j loop;
.         };
 58.         *aggregate into a big data set;
.         append using "$path/work/pref_r_price.dta";
 59.       sort spdomain spdomainq;
 60.       save "$path/work/pref_r_price.dta", replace;
 61.  *close i loop;
. };
(note: dataset contains 0 observations)
file /home/bjvca/data/data/GAP/Haruna/UNPS_2005_06//work/revpref_price_1.dta saved
(94 observations deleted)
(note: file /tmp/St02564.000001 not found)
file /tmp/St02564.000001 saved
(142 observations deleted)
(label lspdomain already defined)
(15 observations deleted)
(0 real changes made)
(0 real changes made)
(note: file /tmp/St02564.000002 not found)
file /tmp/St02564.000002 saved
(18 observations deleted)
file /home/bjvca/data/data/GAP/Haruna/UNPS_2005_06//work/revpref_price_1.dta saved
(140 observations deleted)
(label lspdomain already defined)
(17 observations deleted)
(0 real changes made)
(0 real changes made)
file /tmp/St02564.000002 saved
(18 observations deleted)
(label lspdomain already defined)
file /home/bjvca/data/data/GAP/Haruna/UNPS_2005_06//work/revpref_price_1.dta saved
(139 observations deleted)
(label lspdomain already defined)
(18 observations deleted)
(0 real changes made)
(0 real changes made)
file /tmp/St02564.000002 saved
(18 observations deleted)
(label lspdomain already defined)
file /home/bjvca/data/data/GAP/Haruna/UNPS_2005_06//work/revpref_price_1.dta saved
(140 observations deleted)
(label lspdomain already defined)
(17 observations deleted)
(0 real changes made)
(1 real change made)
file /tmp/St02564.000002 saved
(17 observations deleted)
(note: file /tmp/St02564.000003 not found)
file /tmp/St02564.000003 saved
variable product does not uniquely identify observations in the master data
(label lspdomain already defined)

     _merge |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |        170       97.14       97.14
          3 |          5        2.86      100.00
------------+-----------------------------------
      Total |        175      100.00
(170 observations deleted)
(0 observations deleted)
file /tmp/St02564.000003 saved

     _merge |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |         17       94.44       94.44
          3 |          1        5.56      100.00
------------+-----------------------------------
      Total |         18      100.00
(label lspdomain already defined)
file /home/bjvca/data/data/GAP/Haruna/UNPS_2005_06//work/revpref_price_1.dta saved
(139 observations deleted)
(label lspdomain already defined)
(18 observations deleted)
(0 real changes made)
(0 real changes made)
file /tmp/St02564.000002 saved
(18 observations deleted)
(label lspdomain already defined)
file /home/bjvca/data/data/GAP/Haruna/UNPS_2005_06//work/revpref_price_1.dta saved
file /home/bjvca/data/data/GAP/Haruna/UNPS_2005_06//work/pref_r_price.dta saved
(note: dataset contains 0 observations)
file /home/bjvca/data/data/GAP/Haruna/UNPS_2005_06//work/revpref_price_2.dta saved
(92 observations deleted)
file /tmp/St02564.000001 saved
(142 observations deleted)
(label lspdomain already defined)
(13 observations deleted)
(0 real changes made)
(2 real changes made)
file /tmp/St02564.000002 saved
(18 observations deleted)
file /tmp/St02564.000003 saved
variable product does not uniquely identify observations in the master data
(label lspdomain already defined)

     _merge |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |        165       94.29       94.29
          3 |         10        5.71      100.00
------------+-----------------------------------
      Total |        175      100.00
(165 observations deleted)
(0 observations deleted)
file /tmp/St02564.000003 saved

     _merge |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |         18       90.00       90.00
          3 |          2       10.00      100.00
------------+-----------------------------------
      Total |         20      100.00
file /home/bjvca/data/data/GAP/Haruna/UNPS_2005_06//work/revpref_price_2.dta saved
(140 observations deleted)
(label lspdomain already defined)
(15 observations deleted)
(0 real changes made)
(0 real changes made)
file /tmp/St02564.000002 saved
(20 observations deleted)
(label lspdomain already defined)
file /home/bjvca/data/data/GAP/Haruna/UNPS_2005_06//work/revpref_price_2.dta saved
(139 observations deleted)
(label lspdomain already defined)
(16 observations deleted)
(0 real changes made)
(0 real changes made)
file /tmp/St02564.000002 saved
(20 observations deleted)
(label lspdomain already defined)
file /home/bjvca/data/data/GAP/Haruna/UNPS_2005_06//work/revpref_price_2.dta saved
(140 observations deleted)
(label lspdomain already defined)
(15 observations deleted)
(0 real changes made)
(1 real change made)
file /tmp/St02564.000002 saved
(19 observations deleted)
file /tmp/St02564.000003 saved
variable product does not uniquely identify observations in the master data
(label lspdomain already defined)

     _merge |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |        170       97.14       97.14
          3 |          5        2.86      100.00
------------+-----------------------------------
      Total |        175      100.00
(170 observations deleted)
(0 observations deleted)
file /tmp/St02564.000003 saved

     _merge |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |         19       95.00       95.00
          3 |          1        5.00      100.00
------------+-----------------------------------
      Total |         20      100.00
(label lspdomain already defined)
file /home/bjvca/data/data/GAP/Haruna/UNPS_2005_06//work/revpref_price_2.dta saved
(139 observations deleted)
(label lspdomain already defined)
(16 observations deleted)
(0 real changes made)
(0 real changes made)
file /tmp/St02564.000002 saved
(20 observations deleted)
(label lspdomain already defined)
file /home/bjvca/data/data/GAP/Haruna/UNPS_2005_06//work/revpref_price_2.dta saved
(label lspdomain already defined)
file /home/bjvca/data/data/GAP/Haruna/UNPS_2005_06//work/pref_r_price.dta saved
(note: dataset contains 0 observations)
file /home/bjvca/data/data/GAP/Haruna/UNPS_2005_06//work/revpref_price_3.dta saved
(85 observations deleted)
file /tmp/St02564.000001 saved
(142 observations deleted)
(label lspdomain already defined)
(8 observations deleted)
(2 real changes made)
(9 real changes made)
file /tmp/St02564.000002 saved
(18 observations deleted)
file /tmp/St02564.000003 saved
variable product does not uniquely identify observations in the master data
(label lspdomain already defined)

     _merge |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |        133       76.00       76.00
          3 |         42       24.00      100.00
------------+-----------------------------------
      Total |        175      100.00
(133 observations deleted)
(0 observations deleted)
file /tmp/St02564.000003 saved

     _merge |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |         18       66.67       66.67
          3 |          9       33.33      100.00
------------+-----------------------------------
      Total |         27      100.00
(2 missing values generated)
file /home/bjvca/data/data/GAP/Haruna/UNPS_2005_06//work/revpref_price_3.dta saved
(140 observations deleted)
(label lspdomain already defined)
(9 observations deleted)
(1 real change made)
(3 real changes made)
file /tmp/St02564.000002 saved
(24 observations deleted)
file /tmp/St02564.000003 saved
variable product does not uniquely identify observations in the master data
(label lspdomain already defined)

     _merge |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |        162       92.57       92.57
          3 |         13        7.43      100.00
------------+-----------------------------------
      Total |        175      100.00
(162 observations deleted)
(0 observations deleted)
file /tmp/St02564.000003 saved

     _merge |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |         24       88.89       88.89
          3 |          3       11.11      100.00
------------+-----------------------------------
      Total |         27      100.00
(1 missing value generated)
(label lspdomain already defined)
file /home/bjvca/data/data/GAP/Haruna/UNPS_2005_06//work/revpref_price_3.dta saved
(139 observations deleted)
(label lspdomain already defined)
(9 observations deleted)
(0 real changes made)
(0 real changes made)
file /tmp/St02564.000002 saved
(27 observations deleted)
(label lspdomain already defined)
file /home/bjvca/data/data/GAP/Haruna/UNPS_2005_06//work/revpref_price_3.dta saved
(140 observations deleted)
(label lspdomain already defined)
(8 observations deleted)
(0 real changes made)
(1 real change made)
file /tmp/St02564.000002 saved
(26 observations deleted)
file /tmp/St02564.000003 saved
variable product does not uniquely identify observations in the master data
(label lspdomain already defined)

     _merge |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |        170       97.14       97.14
          3 |          5        2.86      100.00
------------+-----------------------------------
      Total |        175      100.00
(170 observations deleted)
(0 observations deleted)
file /tmp/St02564.000003 saved

     _merge |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |         26       96.30       96.30
          3 |          1        3.70      100.00
------------+-----------------------------------
      Total |         27      100.00
(label lspdomain already defined)
file /home/bjvca/data/data/GAP/Haruna/UNPS_2005_06//work/revpref_price_3.dta saved
(139 observations deleted)
(label lspdomain already defined)
(9 observations deleted)
(0 real changes made)
(0 real changes made)
file /tmp/St02564.000002 saved
(27 observations deleted)
(label lspdomain already defined)
file /home/bjvca/data/data/GAP/Haruna/UNPS_2005_06//work/revpref_price_3.dta saved
(label lspdomain already defined)
file /home/bjvca/data/data/GAP/Haruna/UNPS_2005_06//work/pref_r_price.dta saved
(note: dataset contains 0 observations)
file /home/bjvca/data/data/GAP/Haruna/UNPS_2005_06//work/revpref_price_4.dta saved
(88 observations deleted)
file /tmp/St02564.000001 saved
(142 observations deleted)
(label lspdomain already defined)
(12 observations deleted)
(3 real changes made)
(12 real changes made)
file /tmp/St02564.000002 saved
(12 observations deleted)
file /tmp/St02564.000003 saved
variable product does not uniquely identify observations in the master data
(label lspdomain already defined)

     _merge |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |        118       67.43       67.43
          3 |         57       32.57      100.00
------------+-----------------------------------
      Total |        175      100.00
(118 observations deleted)
(0 observations deleted)
file /tmp/St02564.000003 saved

     _merge |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |         12       50.00       50.00
          3 |         12       50.00      100.00
------------+-----------------------------------
      Total |         24      100.00
(3 missing values generated)
file /home/bjvca/data/data/GAP/Haruna/UNPS_2005_06//work/revpref_price_4.dta saved
(140 observations deleted)
(label lspdomain already defined)
(11 observations deleted)
(0 real changes made)
(6 real changes made)
file /tmp/St02564.000002 saved
(18 observations deleted)
file /tmp/St02564.000003 saved
variable product does not uniquely identify observations in the master data
(label lspdomain already defined)

     _merge |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |        147       84.00       84.00
          3 |         28       16.00      100.00
------------+-----------------------------------
      Total |        175      100.00
(147 observations deleted)
(0 observations deleted)
file /tmp/St02564.000003 saved

     _merge |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |         18       75.00       75.00
          3 |          6       25.00      100.00
------------+-----------------------------------
      Total |         24      100.00
(label lspdomain already defined)
file /home/bjvca/data/data/GAP/Haruna/UNPS_2005_06//work/revpref_price_4.dta saved
(139 observations deleted)
(label lspdomain already defined)
(12 observations deleted)
(0 real changes made)
(0 real changes made)
file /tmp/St02564.000002 saved
(24 observations deleted)
(label lspdomain already defined)
file /home/bjvca/data/data/GAP/Haruna/UNPS_2005_06//work/revpref_price_4.dta saved
(140 observations deleted)
(label lspdomain already defined)
(11 observations deleted)
(0 real changes made)
(0 real changes made)
file /tmp/St02564.000002 saved
(24 observations deleted)
(label lspdomain already defined)
file /home/bjvca/data/data/GAP/Haruna/UNPS_2005_06//work/revpref_price_4.dta saved
(139 observations deleted)
(label lspdomain already defined)
(12 observations deleted)
(0 real changes made)
(0 real changes made)
file /tmp/St02564.000002 saved
(24 observations deleted)
(label lspdomain already defined)
file /home/bjvca/data/data/GAP/Haruna/UNPS_2005_06//work/revpref_price_4.dta saved
(label lspdomain already defined)
file /home/bjvca/data/data/GAP/Haruna/UNPS_2005_06//work/pref_r_price.dta saved
(note: dataset contains 0 observations)
file /home/bjvca/data/data/GAP/Haruna/UNPS_2005_06//work/revpref_price_5.dta saved
(89 observations deleted)
file /tmp/St02564.000001 saved
(142 observations deleted)
(label lspdomain already defined)
(11 observations deleted)
(1 real change made)
(7 real changes made)
file /tmp/St02564.000002 saved
(16 observations deleted)
file /tmp/St02564.000003 saved
variable product does not uniquely identify observations in the master data
(label lspdomain already defined)

     _merge |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |        142       81.14       81.14
          3 |         33       18.86      100.00
------------+-----------------------------------
      Total |        175      100.00
(142 observations deleted)
(0 observations deleted)
file /tmp/St02564.000003 saved

     _merge |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |         16       69.57       69.57
          3 |          7       30.43      100.00
------------+-----------------------------------
      Total |         23      100.00
(1 missing value generated)
file /home/bjvca/data/data/GAP/Haruna/UNPS_2005_06//work/revpref_price_5.dta saved
(140 observations deleted)
(label lspdomain already defined)
(12 observations deleted)
(0 real changes made)
(2 real changes made)
file /tmp/St02564.000002 saved
(21 observations deleted)
file /tmp/St02564.000003 saved
variable product does not uniquely identify observations in the master data
(label lspdomain already defined)

     _merge |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |        166       94.86       94.86
          3 |          9        5.14      100.00
------------+-----------------------------------
      Total |        175      100.00
(166 observations deleted)
(0 observations deleted)
file /tmp/St02564.000003 saved

     _merge |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |         21       91.30       91.30
          3 |          2        8.70      100.00
------------+-----------------------------------
      Total |         23      100.00
(label lspdomain already defined)
file /home/bjvca/data/data/GAP/Haruna/UNPS_2005_06//work/revpref_price_5.dta saved
(139 observations deleted)
(label lspdomain already defined)
(13 observations deleted)
(0 real changes made)
(0 real changes made)
file /tmp/St02564.000002 saved
(23 observations deleted)
(label lspdomain already defined)
file /home/bjvca/data/data/GAP/Haruna/UNPS_2005_06//work/revpref_price_5.dta saved
(140 observations deleted)
(label lspdomain already defined)
(13 observations deleted)
(1 real change made)
(2 real changes made)
file /tmp/St02564.000002 saved
(21 observations deleted)
file /tmp/St02564.000003 saved
variable product does not uniquely identify observations in the master data
(label lspdomain already defined)

     _merge |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |        166       94.86       94.86
          3 |          9        5.14      100.00
------------+-----------------------------------
      Total |        175      100.00
(166 observations deleted)
(0 observations deleted)
file /tmp/St02564.000003 saved

     _merge |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |         21       91.30       91.30
          3 |          2        8.70      100.00
------------+-----------------------------------
      Total |         23      100.00
(1 missing value generated)
(label lspdomain already defined)
file /home/bjvca/data/data/GAP/Haruna/UNPS_2005_06//work/revpref_price_5.dta saved
(139 observations deleted)
(label lspdomain already defined)
(13 observations deleted)
(0 real changes made)
(0 real changes made)
file /tmp/St02564.000002 saved
(23 observations deleted)
(label lspdomain already defined)
file /home/bjvca/data/data/GAP/Haruna/UNPS_2005_06//work/revpref_price_5.dta saved
(label lspdomain already defined)
file /home/bjvca/data/data/GAP/Haruna/UNPS_2005_06//work/pref_r_price.dta saved

. *bring in actual flexible bundle numbers;
. use "$path/work/povline_food_flex_it$it_n.dta", clear;

.         merge spdomain using "$path/work/pref_r_price.dta";
variable spdomain does not uniquely identify observations in
    /home/bjvca/data/data/GAP/Haruna/UNPS_2005_06//work/pref_r_price.dta
(label lspdomain already defined)

.         tab _m;

     _merge |      Freq.     Percent        Cum.
------------+-----------------------------------
          3 |         25      100.00      100.00
------------+-----------------------------------
      Total |         25      100.00

.          drop crap;

.         drop _m;

.         order spdomainq spdomain;

.       sort spdomainq spdomain;

.         *rescale expenditures to hit a constant calorie target;
.         gen povline_f5_s=ratquan*povline_f_flex90_$it_n;

.       compress;
spdomainq was float now byte
spdomain was float now byte
pricemiss was double now byte

. *browse;
.         *categorize revealed preference performance;
.       gen pref_r=0;

.       replace pref_r=1 if float(linf_q)>float(povline_f5_s);
(14 real changes made)

.       replace pref_r=2 if float(linf_q)<float(povline_f5_s);
(7 real changes made)

.       lab var pref_r "Fails or passes revealed preference test";

.       lab def pref_r
>                         0 "comparison of the same region with itself"
>                         1 "passes revealed preference test"
>                         2 "fails revealed preference test" ;

.         lab val pref_r pref_r;

.       drop if spdomainq==spdomain;
(5 observations deleted)

.         tab pref_r;

    Fails or passes revealed preference |
                                   test |      Freq.     Percent        Cum.
----------------------------------------+-----------------------------------
        passes revealed preference test |         13       65.00       65.00
         fails revealed preference test |          7       35.00      100.00
----------------------------------------+-----------------------------------
                                  Total |         20      100.00

.              sort spdomainq ;

.       by spdomainq: tab pref_r;

----------------------------------------------------------------------------------------------
-> spdomainq = 1

    Fails or passes revealed preference |
                                   test |      Freq.     Percent        Cum.
----------------------------------------+-----------------------------------
        passes revealed preference test |          4      100.00      100.00
----------------------------------------+-----------------------------------
                                  Total |          4      100.00

----------------------------------------------------------------------------------------------
-> spdomainq = 2

    Fails or passes revealed preference |
                                   test |      Freq.     Percent        Cum.
----------------------------------------+-----------------------------------
        passes revealed preference test |          1       25.00       25.00
         fails revealed preference test |          3       75.00      100.00
----------------------------------------+-----------------------------------
                                  Total |          4      100.00

----------------------------------------------------------------------------------------------
-> spdomainq = 3

    Fails or passes revealed preference |
                                   test |      Freq.     Percent        Cum.
----------------------------------------+-----------------------------------
        passes revealed preference test |          4      100.00      100.00
----------------------------------------+-----------------------------------
                                  Total |          4      100.00

----------------------------------------------------------------------------------------------
-> spdomainq = 4

    Fails or passes revealed preference |
                                   test |      Freq.     Percent        Cum.
----------------------------------------+-----------------------------------
         fails revealed preference test |          4      100.00      100.00
----------------------------------------+-----------------------------------
                                  Total |          4      100.00

----------------------------------------------------------------------------------------------
-> spdomainq = 5

    Fails or passes revealed preference |
                                   test |      Freq.     Percent        Cum.
----------------------------------------+-----------------------------------
        passes revealed preference test |          4      100.00      100.00
----------------------------------------+-----------------------------------
                                  Total |          4      100.00


. save "$path/work/pref_r_price.dta", replace;
file /home/bjvca/data/data/GAP/Haruna/UNPS_2005_06//work/pref_r_price.dta saved

. *drop comparisons with Maputo ;
. drop if spdomain>=11;
(0 observations deleted)

. drop if spdomainq>=11;
(0 observations deleted)

. display "this is with maputo dropped";
this is with maputo dropped

. tab pref_r;

    Fails or passes revealed preference |
                                   test |      Freq.     Percent        Cum.
----------------------------------------+-----------------------------------
        passes revealed preference test |         13       65.00       65.00
         fails revealed preference test |          7       35.00      100.00
----------------------------------------+-----------------------------------
                                  Total |         20      100.00

. *further drop Nampula rural and urban;
. drop if spdomain==3 | spdomain==4;
(8 observations deleted)

. display "this is with maputo and nampula dropped (MAH: Actually not - experimenting with 6 s
> patial domains)";
this is with maputo and nampula dropped (MAH: Actually not - experimenting with 6 spatial doma
> ins)

. tab pref_r;

    Fails or passes revealed preference |
                                   test |      Freq.     Percent        Cum.
----------------------------------------+-----------------------------------
        passes revealed preference test |          7       58.33       58.33
         fails revealed preference test |          5       41.67      100.00
----------------------------------------+-----------------------------------
                                  Total |         12      100.00

. **************************************************************************
> * 170_pref_r_price.do           (end)
> **************************************************************************;
. log close;
      name:  <unnamed>
       log:  /home/bjvca/data/data/GAP/Haruna/UNPS_2005_06//rep/170_pref_r_price.log
  log type:  text
 closed on:  10 Mar 2014, 14:48:52
----------------------------------------------------------------------------------------------
